{
  "inicio": "2025-08-08T14:50:17.213814",
  "conversaciones": [
    {
      "timestamp": "2025-08-08T14:55:03.261115",
      "usuario": "Quiero que me generes casos de prueba mediante este documento de analisis y las fotos del figma para que puedas guiarte:\nRELEVAMIENTO Y ANÁLISIS FUNCIONAL \n\nMÓDULO DE RECLAMOS Y CONTRACARGOS \n\n(ROLES: EMISOR Y ADQUIRENTE) \n\nCliente: BEPSA \n\nAnalista: Ricardo Iglesias – Derlis Garcia \n\n \n\n1. Análisis Conceptual \n\n1.1 Definición del problema \n\nActualmente, las entidades financieras, cooperativas y el área de CAC de Bepsa no cuentan con un sistema centralizado, automatizado y trazable para gestionar los reclamos y contracargos sobre transacciones realizadas con tarjetas (débito, crédito, billeteras y prepagas). Hoy el proceso depende de herramientas como Excel, correo electrónico y Azure, lo cual genera problemas en la gestión de plazos, asignación de responsabilidades, trazabilidad, generación de alertas por vencimientos de plazos, informes y control de casos. \n\n1.2 Objetivos y Alcance \n\nObjetivo general \n\nDesarrollar un módulo robusto, configurable y centralizado para gestionar reclamos y contracargos, que permita: \n\nRegistro de reclamos por entidades emisoras y adquirentes. \n\nAsignación automática de analistas según entidad/marca. \n\nGestión de plazos por tipo de reclamo y marca. \n\nSeguimiento completo del ciclo de vida del reclamo. \n\nGeneración de informes, notas y auditoría completa. \n\nAlcance inicial \n\nImplementación para tarjetas: Visa, Mastercard, Dinelco (ambos roles) y Discover (solo adquirente). \n\nSoporte para productos: Débito, Crédito, Prepaga y Billeteras. \n\nCobertura de operaciones locales, internacionales y regionales. \n\nGestión específica de contracargos, ajustes en marca, reclamos generales, entre otros. \n\nTipos de reclamo: fraude, controversia, errores operativos, problemas de autorización, entre otros. \n\nForma \n\n2. Análisis de Requerimientos \n\n2.1 Requerimientos Funcionales \n\nAccesos diferenciados según rol (Emisor, Adquirente, CAC, Administrador). \n\nConsulta de transacciones y autorizaciones de Bepsa. (Ver documento adjunto – API proveída por BEPSA) \n\nFiltro y selección de transacciones por: tipo producto (debito/ crédito), fecha, marca, numero de tarjeta, numero de cupón, descripción de transacción, numero de documento. \n\nSelección masiva de transacciones (definir límite de transacciones por tarjeta). \n\nControl automático de vencimientos según marca y tipo de transacción. \n\nBloqueo de transacciones vencidas para contracargo. \n\nValidación contra reglas específicas de cada marca. \n\nCarga de reclamos por tarjeta (emisor) o por comercio (adquirente). \n\nAsignación automática de casos a analistas mediante tablas paramétricas de entidad/marca y asignación equitativa en caso de que existan varios analistas por entidad/marca. \n\nGestión de tipos de reclamo: fraude, controversia del tarjetahabiente, errores de procesamiento, errores de autorización entre otros. \n\nSeguimiento del reclamo por estados predefinidos: sin asignar, asignado, en análisis, contracargos, representación, pre-arbitraje, arbitraje, en marcas, en tesorería, devuelto a la entidad, en pausa, cerrado. \n\nVisualización del detalle de la transacción reclamada, incluyendo: \n\nFecha de transacción. \n\nFecha de vencimiento del contracargo. \n\nAlertas automáticas de vencimiento de plazos configurables. \n\nComentarios internos (Bepsa) y externos (entidad o comercio). \n\nModificación limitada a la descripción del reclamo una vez cargado. \n\nAdjuntos y seguimiento de documentos/correos. \n\nGeneración de notas. \n\nDerivación de casos a áreas internas. \n\nIntegración con tarifarios para facturación de servicios. \n\nReportes y Dashboards definidos: \n\nReportes y Dashboards por Emisores y Adquirientes: Visualizacion general del estado de casos. Tipos y motivos de contracargos. \n\nReportes y Dashboards por Reclamos: Visualización general del estado de los casos gestionados en reclamos. Información sobre tiempos de respuesta, resolución y otras estadísticas relevantes. \n\n \n\n2.2 Requerimientos No Funcionales \n\nSeguridad y control de accesos por perfil de usuario. \n\nParametrización de reglas por entidad, marca, vencimientos. \n\nInterfaz intuitiva, responsiva y con validaciones. \n\nEscalabilidad para nuevas marcas/productos. \n\nTrazabilidad completa de acciones. \n\n\n\nNotificaciones claras y automáticas de vencimiento de plazos. \n\nSoporte para integraciones futuras con CRM y sistemas externos. \n\nForma \n\n3. Casos de Uso Principales \n\nCarga de Reclamo (Emisor): \n\nEl operador selecciona transacciones desde movimientos y autorizaciones. \n\nEl sistema verifica los plazos. \n\nSe asigna analista automáticamente y se inicia el reclamo. \n\nCarga de Reclamo (Adquirente): \n\nSelección de transacciones por comercio. \n\nAlta del caso, adjuntos y asignación. \n\nSeguimiento del Caso: \n\nCambio de estado del reclamo. \n\nRegistro de comentarios y novedades. \n\nAlertas visuales de plazos de vencimiento. \n\nGeneración de Nota: \n\nCuando no procede contracargo. \n\nGeneración agrupada por tarjeta. \n\nInforme de Gestión: \n\nExportación de reclamos, tiempos, estados, marcas y usuarios. \n\nTablero de Estados y Vencimientos. \n\nGestión Documental: \n\nAdjuntar archivos, correos. \n\nAdministración Referenciales: \n\nGestión de marcas, vencimientos, productos, analistas y configuraciones de sistema. \n\nForma \n\n4. Reglas de Negocio \n\nCada reclamo debe estar asociado a una única tarjeta (emisor) o comercio (adquirente). \n\nEl sistema debe validar que los plazos estén vigentes al momento de seleccionar transacciones. \n\nLa asignación de casos a los analistas debe respetar reglas de carga equitativa por entidad/marca. \n\nSolo el analista asignado puede modificar estados, agregar comentarios y adjuntar documentos. \n\nComentarios internos (solo Bepsa) y comentarios externos (comunicables a entidades/ comercios). \n\nEl administrador puede editar la descripción o reasignar. \n\nTodas las acciones deben quedar registradas en el historial (analistas asignados, notas o comentarios, adjuntos y cambios en el registro). \n\nSe deben emitir alertas ante proximidad de vencimientos. \n\nLa edición del caso se limita a comentarios y adjuntos una vez creado. \n\n \n\n5. Análisis Técnico \n\n5.1 Diseño de la Solución \n\nArquitectura propuesta \n\nCliente Web + API REST + Base de Datos relacional. \n\nDiseño UI/UX \n\nInterfaz responsive con filtros intuitivos, alertas visuales, panel de estado y formularios progresivos. \n\nModelo de datos \n\nEntidades principales: Reclamos, Transacciones, Analistas, Notas, Comentarios, Documentos, Marcas. \n\nIntegraciones \n\nConsulta de transacciones y autorizaciones de Bepsa. \n\nFuturas integraciones con sistema de tarifarios. \n\n5.2 Planificación para Desarrollo \n\nFase 1: Análisis funcional, diseño de estructura de datos y diseño de prototipos (2 semanas). \n\nFase 2: Desarrollo del Backend en PrimeNG v20 y base de datos PostgreSQL 16 (4 semanas). \n\nFase 3: Desarrollo del Frontend ReactJs con Next.js e integración con APIs (5 semanas). \n\nFase 4: Pruebas funcionales, QA y ajustes (2 semanas). \n\nFase 5: Capacitación a usuarios clave y despliegue (3 semanas). \n\nForma \n\n6. Análisis de Factibilidad \n\n6.1 Factibilidad Técnica \n\nTecnologías disponibles y conocidas. \n\nInfraestructura de Bepsa puede soportar arquitectura propuesta. \n\nIntegraciones viables mediante APIs. \n\nViabilidad: Alta \n\n6.2 Factibilidad Operativa \n\nRoles actuales compatibles con uso del sistema. \n\nIntegración progresiva con CRM es viable (en caso de que se requiera). \n\nViabilidad: Alta \n\n6.3 Factibilidad de Tiempo y Recursos \n\nCronograma estimado de 6 meses es razonable. \n\nRequiere equipo técnico interno y validación funcional por usuarios clave. \n\nRequiere coordinación con área de sistemas y seguridad. \n\nViabilidad: Moderada-Alta \n\n6.4 Conclusión de Viabilidad: \n\nEs Viable. Se recomienda avanzar con el proyecto. \n\nForma \n\nConclusión General \n\nEl presente análisis (conceptual, de requerimientos, técnico y de factibilidad) ha demostrado que el desarrollo del módulo de reclamos y contracargos no solo es técnicamente viable, sino también operativamente integrable en los procesos actuales de la organización.  \n\nLa solución propuesta contempla todas las funcionalidades claves para mejorar la eficiencia operativa, la trazabilidad, el cumplimiento normativo y la experiencia de los usuarios internos y externos, además de suprimir el uso de herramientas dispersas que actualmente utilizan. \n\nLa arquitectura moderna propuesta, está basada en tecnologías robustas y con un enfoque centrado en el usuario validado mediante prototipos a ser propuestos, se asegura una implementación eficiente, escalable y alineada con las necesidades del negocio. \n\nSe sugiere considerar esta propuesta como una inversión estratégica que fortalecerá los lazos con los clientes, aportando valor real y medible desde su implementación. \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\nDOCUMENTACIÓN RELEVADA ADJUNTA \n\nMódulo de Contracargos \n\nField  \n\nCampos de Visa \n\nData Element  \n\nCampos de Mastercard  \n\nEstos campos deben ser informados en el modulo con sus descripciones principales más el campo.  \n\nEjemplo:  Field 22/ DE022 – Modo de Entrada de la Trx: 05 – Chip  \n\nCampo \n\nNombre del Campo \n\nDescripción \n\nObservación \n\nF2/ DE002  \n\nNro. de Tarjeta \n\nInforma el número de tarjeta que participo de la autorización  \n\n \n\nF14/ DE014 \n\nVencimiento de la tarjeta  \n\nExpiration Date \n\n \n\nF13/ DE013 \n\nFecha Transaccion \n\nLocal Transaction Date/Time \n\n \n\nF12/D012 \n\nHora Transacción \n\nLocal Trans Time \n\n \n\nF5 \n\nTransaction Amount \n\n \n\n \n\nF50 \n\nTransaction Amount \n\n \n\n \n\nDE004 \n\nTxn Amt \n\n \n\n \n\nDE005 \n\nSettle Amt \n\n \n\n \n\nF4, F49 \n\nLocal Transaction Amount \n\n \n\n \n\nDE049 \n\nCurr Code \n\n \n\n \n\nDE050 \n\nSettl Curr Cd \n\n \n\n \n\nF10 \n\nConversion Rate \n\n \n\n \n\nDE009 \n\nSettle Convert Rate \n\n \n\n \n\nF104 \n\nPlan Owner \n\nNumber of Installment Payments \n\n \n\n \n\nDE112S09F02 \n\nNumber Installments \n\n \n\n \n\nDE112S44F05 \n\nNumber of Payment \n\n \n\n \n\nF37/ DE037 \n\nRRN - Retrieval Ref. Number  \n\n \n\n \n\nF43 \n\nMerchant Country Code \n\nLocation \n\nMerchant Country Code  \n\n \n\n \n\nDE043 \n\nDE043S01 \n\nDE043S03 \n\nDE043S05 \n\nMerchant Name, Merchants City, Country \n\n \n\n \n\nDE018/ F18 \n\nMerchant Category Code (MCC) \n\n \n\n \n\nF39 \n\nCodigo Respuesta \n\n \n\n \n\nF44.1 \n\nAuthorization Source Ind \n\n \n\n \n\nDE044 \n\nAdditional Response \n\n \n\n \n\nF126.10 \n\nCVV2 Response Type \n\n \n\n \n\nF44.5 \n\nCVV Result \n\n \n\n \n\nF38/ DE038 \n\nCod. Autorización \n\n \n\n \n\nDE048S92 \n\nCVC2 Presence Ind \n\n \n\n \n\nDE048S42 \n\nECOM Indicators \n\n \n\n \n\nDE048S42F01 \n\nECOM Sec UCAF Ind \n\n \n\n \n\nDE048S43 \n\nUCAF \n\n \n\n \n\nDE048S87 \n\nCard Auth Method \n\n \n\n \n\nDE048S66F01 \n\nProgram Protocol \n\n \n\n \n\nField 22/ DE022 \n\nPOS Entry Mode \n\n \n\nchip, contactless, banda magnetica, manual \n\nDE022F01 \n\nPOS Entry Mode \n\n \n\n \n\nDE022F02 \n\nPOS PIN Entry Mode \n\n \n\n \n\nF22.2 \n\nPIN Entry Capability \n\n \n\n \n\nF3 \n\nMensaje MTI \n\n \n\n \n\nDE090S01 \n\nMTI \n\n \n\n \n\nF32  \n\nAcquirer Institution ID  \n\nIssuer Institution ID \n\n \n\n \n\nF63.8 \n\nAcquirer BID \n\n \n\n \n\nDE000S09/ DE032 \n\nAcquiring ICA \n\n \n\n \n\nDE000S10 \n\nIssuing ICA \n\n \n\n \n\nField 25 – Visa  \n\nCondition del Pos \n\n \n\nValid Values - Table 30: Field 25 POS Condition Codes \n\nField 52- Visa \n\nPin presente en la trx  \n\n \n\n \n\nField 22.2 \n\nCapacidad de ingreso de PIN \n\n \n\n \n\nF60 \n\nTerminal Entry Capability \n\n \n\n \n\nDE061S01 \n\nPOS Terminal Att Ind \n\n \n\n \n\nDE061S03 \n\nPOS Terminal Loc \n\n \n\n \n\nField 60.8 – VISA \n\nParticipa 3DS \n\nPositions 9-10: valor 05 para visa \n\n \n\nDATOS TABLAS DE BEPSA – Programa Ref.SWTRG010 \n\nCódigo Transacción \n\nEjemplo: 011000  RETIRO EFECTIVO AHORRO ATM \n\nCódigo Comercio \n\nSi el código de comercio es de Bepsa \n\nSituación \n\nejemplo dudoso, reversada, otro \n\nOrigen Trx \n\nEj. *BEPSA  \n\nRespondido por \n\nEj. *BNF",
      "bot": "CP-1: Verificar el acceso al módulo con rol de Emisor\nDescripción: Validar que un usuario con rol de Emisor puede acceder al módulo de Reclamos y Contracargos.\nFecha de creación: 2024-02-29\nNº ID: 1\nMódulo: Autenticación y Autorización\nPrioridad: Alta\nStatus: Por hacer\nResultado esperado: El usuario con rol de Emisor puede iniciar sesión y visualizar la interfaz principal del módulo de Reclamos y Contracargos.\nPaso a paso de la prueba:\n1. Ingresar al sistema con un usuario que tenga asignado el rol de Emisor.\n2. Verificar que el menú de navegación muestra la opción \"Reclamos y Contracargos\".\n3. Hacer clic en la opción \"Reclamos y Contracargos\".\n4. Validar que se visualiza la interfaz principal del módulo, con las opciones correspondientes al rol de Emisor.\n\nCP-2: Verificar el acceso al módulo con rol de Adquirente\nDescripción: Validar que un usuario con rol de Adquirente puede acceder al módulo de Reclamos y Contracargos.\nFecha de creación: 2024-02-29\nNº ID: 2\nMódulo: Autenticación y Autorización\nPrioridad: Alta\nStatus: Por hacer\nResultado esperado: El usuario con rol de Adquirente puede iniciar sesión y visualizar la interfaz principal del módulo de Reclamos y Contracargos.\nPaso a paso de la prueba:\n1. Ingresar al sistema con un usuario que tenga asignado el rol de Adquirente.\n2. Verificar que el menú de navegación muestra la opción \"Reclamos y Contracargos\".\n3. Hacer clic en la opción \"Reclamos y Contracargos\".\n4. Validar que se visualiza la interfaz principal del módulo, con las opciones correspondientes al rol de Adquirente.\n\nCP-3: Verificar la consulta de transacciones como Emisor\nDescripción: Validar que un usuario con rol de Emisor puede consultar transacciones para iniciar un reclamo.\nFecha de creación: 2024-02-29\nNº ID: 3\nMódulo: Carga de Reclamo (Emisor)\nPrioridad: Alta\nStatus: Por hacer\nResultado esperado: El sistema permite al Emisor filtrar y seleccionar transacciones según los criterios definidos (tipo producto, fecha, marca, número de tarjeta, número de cupón, descripción de transacción, número de documento).\nPaso a paso de la prueba:\n1. Ingresar al módulo de Reclamos y Contracargos con un usuario rol Emisor.\n2. Navegar a la sección de \"Carga de Reclamo\" o similar.\n3. Utilizar los filtros disponibles para buscar transacciones (ej: tipo de producto \"Crédito\", marca \"Visa\", número de tarjeta \"4567890123456789\").\n4. Validar que se muestran las transacciones que coinciden con los criterios de búsqueda.\n5. Verificar que se visualizan los campos: tipo producto (debito/ crédito), fecha, marca, numero de tarjeta, numero de cupón, descripción de transacción, numero de documento.\n\nCP-4: Verificar el control de vencimientos al seleccionar transacciones (Emisor)\nDescripción: Validar que el sistema verifica los plazos de vencimiento al momento de seleccionar transacciones para un reclamo como Emisor.\nFecha de creación: 2024-02-29\nNº ID: 4\nMódulo: Carga de Reclamo (Emisor)\nPrioridad: Alta\nStatus: Por hacer\nResultado esperado: El sistema verifica que los plazos estén vigentes al momento de seleccionar transacciones y muestra un mensaje de error si la transacción está vencida.\nPaso a paso de la prueba:\n1. Ingresar al módulo de Reclamos y Contracargos con un usuario rol Emisor.\n2. Navegar a la sección de \"Carga de Reclamo\" o similar.\n3. Buscar una transacción vencida según las reglas de la marca correspondiente.\n4. Intentar seleccionar la transacción vencida para iniciar un reclamo.\n5. Validar que el sistema muestra un mensaje de error indicando que la transacción está vencida y no se puede continuar con el reclamo.\n\nCP-5: Verificar la carga de un reclamo exitoso (Emisor)\nDescripción: Validar que un usuario con rol de Emisor puede cargar un reclamo exitosamente luego de seleccionar una transacción válida.\nFecha de creación: 2024-02-29\nNº ID: 5\nMódulo: Carga de Reclamo (Emisor)\nPrioridad: Alta\nStatus: Por hacer\nResultado esperado: El sistema permite al Emisor completar la información del reclamo, adjuntar documentos y guardar el reclamo exitosamente, asignando automáticamente un analista.\nPaso a paso de la prueba:\n1. Ingresar al módulo de Reclamos y Contracargos con un usuario rol Emisor.\n2. Navegar a la sección de \"Carga de Reclamo\" o similar.\n3. Buscar y seleccionar una transacción válida.\n4. Completar los campos requeridos para el reclamo (tipo de reclamo, descripción, etc.).\n5. Adjuntar un documento (opcional).\n6. Guardar el reclamo.\n7. Validar que el sistema muestra un mensaje de confirmación de que el reclamo se guardó exitosamente.\n8. Verificar que el reclamo se asignó automáticamente a un analista (verificar en la sección de seguimiento del caso o similar).\n\nCP-6: Verificar la consulta de transacciones como Adquirente\nDescripción: Validar que un usuario con rol de Adquirente puede consultar transacciones para iniciar un reclamo.\nFecha de creación: 2024-02-29\nNº ID: 6\nMódulo: Carga de Reclamo (Adquirente)\nPrioridad: Alta\nStatus: Por hacer\nResultado esperado: El sistema permite al Adquirente filtrar y seleccionar transacciones por comercio.\nPaso a paso de la prueba:\n1. Ingresar al módulo de Reclamos y Contracargos con un usuario rol Adquirente.\n2. Navegar a la sección de \"Carga de Reclamo\" o similar.\n3. Utilizar los filtros disponibles para buscar transacciones por comercio.\n4. Validar que se muestran las transacciones que coinciden con los criterios de búsqueda.\n\nCP-7: Verificar la carga de un reclamo exitoso (Adquirente)\nDescripción: Validar que un usuario con rol de Adquirente puede cargar un reclamo exitosamente luego de seleccionar una transacción válida.\nFecha de creación: 2024-02-29\nNº ID: 7\nMódulo: Carga de Reclamo (Adquirente)\nPrioridad: Alta\nStatus: Por hacer\nResultado esperado: El sistema permite al Adquirente completar la información del reclamo, adjuntar documentos y guardar el reclamo exitosamente, asignando automáticamente un analista.\nPaso a paso de la prueba:\n1. Ingresar al módulo de Reclamos y Contracargos con un usuario rol Adquirente.\n2. Navegar a la sección de \"Carga de Reclamo\" o similar.\n3. Buscar y seleccionar una transacción válida.\n4. Completar los campos requeridos para el reclamo (tipo de reclamo, descripción, etc.).\n5. Adjuntar un documento (opcional).\n6. Guardar el reclamo.\n7. Validar que el sistema muestra un mensaje de confirmación de que el reclamo se guardó exitosamente.\n8. Verificar que el reclamo se asignó automáticamente a un analista.\n\nCP-8: Verificar el cambio de estado de un reclamo\nDescripción: Validar que un analista asignado puede cambiar el estado de un reclamo.\nFecha de creación: 2024-02-29\nNº ID: 8\nMódulo: Seguimiento del Caso\nPrioridad: Media\nStatus: Por hacer\nResultado esperado: El sistema permite al analista cambiar el estado del reclamo a través de los estados predefinidos (sin asignar, asignado, en análisis, contracargos, representación, pre-arbitraje, arbitraje, en marcas, en tesorería, devuelto a la entidad, en pausa, cerrado).\nPaso a paso de la prueba:\n1. Ingresar al módulo de Reclamos y Contracargos con un usuario que tenga rol de analista.\n2. Buscar un reclamo que esté asignado al analista.\n3. Acceder al detalle del reclamo.\n4. Cambiar el estado del reclamo a uno diferente al actual.\n5. Guardar los cambios.\n6. Validar que el sistema muestra un mensaje de confirmación y que el estado del reclamo se actualizó correctamente.\n\nCP-9: Verificar el registro de comentarios en un reclamo\nDescripción: Validar que un analista asignado puede registrar comentarios internos y externos en un reclamo.\nFecha de creación: 2024-02-29\nNº ID: 9\nMódulo: Seguimiento del Caso\nPrioridad: Media\nStatus: Por hacer\nResultado esperado: El sistema permite al analista agregar comentarios internos (solo visibles para Bepsa) y comentarios externos (visibles para la entidad o comercio).\nPaso a paso de la prueba:\n1. Ingresar al módulo de Reclamos y Contracargos con un usuario que tenga rol de analista.\n2. Buscar un reclamo que esté asignado al analista.\n3. Acceder al detalle del reclamo.\n4. Agregar un comentario interno.\n5. Agregar un comentario externo.\n6. Guardar los cambios.\n7. Validar que los comentarios se guardaron correctamente y se visualizan en el historial del reclamo, con la indicación de si son internos o externos.\n\nCP-10: Verificar las alertas visuales de plazos de vencimiento\nDescripción: Validar que el sistema muestra alertas visuales cuando un reclamo está próximo a vencer.\nFecha de creación: 2024-02-29\nNº ID: 10\nMódulo: Seguimiento del Caso\nPrioridad: Media\nStatus: Por hacer\nResultado esperado: El sistema muestra alertas visuales (ej: cambio de color, icono de advertencia) en la lista de reclamos y/o en el detalle del reclamo cuando la fecha de vencimiento está próxima.\nPaso a paso de la prueba:\n1. Ingresar al módulo de Reclamos y Contracargos con un usuario que tenga rol de analista o administrador.\n2. Buscar un reclamo cuya fecha de vencimiento esté próxima (ej: 3 días antes del vencimiento).\n3. Verificar que el reclamo muestra una alerta visual indicando la proximidad del vencimiento.\n4. Configurar el sistema para enviar alertas con distintos tiempos de anticipación y verificar el funcionamiento.\n\nCP-11: Verificar la generación de notas\nDescripción: Validar que el sistema permite generar notas para un reclamo cuando no procede el contracargo.\nFecha de creación: 2024-02-29\nNº ID: 11\nMódulo: Generación de Nota\nPrioridad: Media\nStatus: Por hacer\nResultado esperado: El sistema permite al analista generar una nota indicando que no procede el contracargo, con la posibilidad de agrupar notas por tarjeta.\nPaso a paso de la prueba:\n1. Ingresar al módulo de Reclamos y Contracargos con un usuario que tenga rol de analista.\n2. Buscar un reclamo en el que se ha determinado que no procede el contracargo.\n3. Acceder a la función de \"Generar Nota\" o similar.\n4. Completar la información requerida para la nota.\n5. Generar la nota.\n6. Validar que la nota se generó correctamente y se puede visualizar/descargar.\n7. Verificar la funcionalidad de agrupar notas por tarjeta.\n\nCP-12: Verificar la exportación del informe de gestión\nDescripción: Validar que el sistema permite exportar el informe de gestión con los datos de los reclamos.\nFecha de creación: 2024-02-29\nNº ID: 12\nMódulo: Informe de Gestión\nPrioridad: Baja\nStatus: Por hacer\nResultado esperado: El sistema permite exportar un informe con los datos de los reclamos, incluyendo: tiempos, estados, marcas y usuarios.\nPaso a paso de la prueba:\n1. Ingresar al módulo de Reclamos y Contracargos con un usuario que tenga los permisos necesarios.\n2. Navegar a la sección de \"Informes\" o similar.\n3. Seleccionar el informe de gestión de reclamos.\n4. Definir los filtros deseados (ej: rango de fechas, marca, estado).\n5. Exportar el informe en un formato adecuado (ej: Excel, CSV).\n6. Validar que el informe exportado contiene los datos correctos y completos.\n\nCP-13: Verificar la gestión documental (adjuntar archivos)\nDescripción: Validar que el sistema permite adjuntar archivos a un reclamo.\nFecha de creación: 2024-02-29\nNº ID: 13\nMódulo: Gestión Documental\nPrioridad: Media\nStatus: Por hacer\nResultado esperado: El sistema permite adjuntar archivos de diferentes formatos a un reclamo.\nPaso a paso de la prueba:\n1. Ingresar al módulo de Reclamos y Contracargos con un usuario que tenga los permisos necesarios.\n2. Buscar un reclamo existente.\n3. Acceder a la sección de \"Adjuntos\" o similar.\n4. Seleccionar un archivo para adjuntar.\n5. Cargar el archivo.\n6. Validar que el archivo se adjuntó correctamente y se puede descargar.\n\nCP-14: Verificar la administración de marcas\nDescripción: Validar que un administrador puede gestionar las marcas en el sistema.\nFecha de creación: 2024-02-29\nNº ID: 14\nMódulo: Administración Referenciales\nPrioridad: Media\nStatus: Por hacer\nResultado esperado: El administrador puede agregar, editar y eliminar marcas en el sistema.\nPaso a paso de la prueba:\n1. Ingresar al módulo de Reclamos y Contracargos con un usuario que tenga rol de administrador.\n2. Navegar a la sección de \"Administración\" o similar.\n3. Acceder a la gestión de \"Marcas\".\n4. Agregar una nueva marca.\n5. Editar una marca existente.\n6. Eliminar una marca.\n7. Validar que las operaciones se realizan correctamente y los cambios se reflejan en el sistema.\n\nCP-15: Validar la asignación automática de analistas.\nDescripción: Verificar que el sistema asigna automáticamente los casos a los analistas basándose en las tablas paramétricas de entidad/marca y la asignación equitativa.\nFecha de creación: 2024-02-29\nNº ID: 15\nMódulo: Asignación automática\nPrioridad: Alta\nStatus: Por hacer\nResultado esperado: Al crear un nuevo reclamo, el sistema debe asignar un analista según la entidad/marca y, si hay varios analistas disponibles para esa entidad/marca, debe seleccionar el analista con menos casos asignados.\nPaso a paso de la prueba:\n1. Configurar las tablas paramétricas de entidad/marca y asignar varios analistas a una misma entidad/marca.\n2. Crear varios reclamos para esa entidad/marca.\n3. Verificar que los reclamos se asignan automáticamente a los diferentes analistas de forma equitativa.\n\nCP-16:  Validar la edición limitada de la descripción del reclamo\nDescripción: Validar que la edición de la descripción del reclamo está limitada una vez cargado.\nFecha de creación: 2024-02-29\nNº ID: 16\nMódulo: Seguimiento del Caso\nPrioridad: Media\nStatus: Por hacer\nResultado esperado: Una vez que el reclamo ha sido cargado, solo el administrador puede editar la descripción del mismo. Otros roles no deben poder modificarla.\nPaso a paso de la prueba:\n1.  Crear un reclamo con un usuario con rol de emisor o adquirente.\n2.  Intentar editar la descripción del reclamo con ese mismo usuario. Verificar que no es posible.\n3.  Ingresar con un usuario con rol de administrador.\n4.  Verificar que el administrador puede editar la descripción del reclamo.\n\nCP-17: Validar el registro en el historial de todas las acciones.\nDescripción: Validar que todas las acciones realizadas en un reclamo (asignación de analistas, notas o comentarios, adjuntos y cambios en el registro) quedan registradas en el historial del mismo.\nFecha de creación: 2024-02-29\nNº ID: 17\nMódulo: Seguimiento del Caso\nPrioridad: Alta\nStatus: Por hacer\nResultado esperado: El historial del reclamo debe mostrar un registro de todas las acciones realizadas en el mismo, incluyendo la fecha y hora, el usuario que realizó la acción y los detalles de la misma.\nPaso a paso de la prueba:\n1. Crear un reclamo.\n2. Asignar un analista al reclamo.\n3. Agregar una nota al reclamo.\n4. Agregar un comentario al reclamo.\n5. Adjuntar un archivo al reclamo.\n6. Cambiar el estado del reclamo.\n7. Verificar que todas estas acciones quedan registradas en el historial del reclamo.\n\nCP-18: Validar que el administrador puede reasignar un caso\nDescripción: Validar que el administrador puede reasignar un caso a otro analista.\nFecha de creación: 2024-02-29\nNº ID: 18\nMódulo: Seguimiento del Caso\nPrioridad: Media\nStatus: Por hacer\nResultado esperado: El sistema debe permitir al administrador reasignar un caso a otro analista, y esta acción debe quedar registrada en el historial del caso.\nPaso a paso de la prueba:\n1. Ingresar al sistema con un usuario con rol de administrador.\n2. Buscar un caso asignado a un analista.\n3. Acceder al detalle del caso.\n4. Reasignar el caso a otro analista.\n5. Verificar que el caso se reasigna correctamente al nuevo analista.\n6. Verificar que la reasignación queda registrada en el historial del caso.\n\nCP-19: Validar el bloqueo de transacciones vencidas para contracargo\nDescripción: El sistema debe bloquear las transacciones vencidas, impidiendo que se utilicen para un contracargo.\nFecha de creación: 2024-02-29\nNº ID: 19\nMódulo: Carga de Reclamo\nPrioridad: Alta\nStatus: Por hacer\nResultado esperado: Al intentar seleccionar una transacción vencida, el sistema debe mostrar un mensaje de error y no permitir continuar con el proceso de contracargo.\nPaso a paso de la prueba:\n1. Intentar seleccionar una transacción que ya haya superado la fecha límite para el contracargo.\n2. Verificar que el sistema muestra un mensaje de error indicando que la transacción no es válida para contracargo debido a que ha expirado el plazo.\n\nCP-20: Validar la gestión de tipos de reclamo\nDescripción: El sistema debe permitir la gestión de diferentes tipos de reclamo (fraude, controversia del tarjetahabiente, errores de procesamiento, errores de autorización, entre otros).\nFecha de creación: 2024-02-29\nNº ID: 20\nMódulo: Administración Referenciales\nPrioridad: Media\nStatus: Por hacer\nResultado esperado: El sistema debe permitir agregar, modificar y eliminar los tipos de reclamo, y estos deben estar disponibles al momento de crear un nuevo reclamo.\nPaso a paso de la prueba:\n1. Ingresar al sistema con un usuario con rol de administrador.\n2. Navegar a la sección de administración de tipos de reclamo.\n3. Agregar un nuevo tipo de reclamo.\n4. Modificar un tipo de reclamo existente.\n5. Eliminar un tipo de reclamo.\n6. Crear un nuevo reclamo y verificar que los tipos de reclamo creados y modificados están disponibles en la lista de selección.\n\nCP-21: Validar la correcta visualización de los campos de Visa y Mastercard\nDescripción: Validar que los campos específicos de Visa y Mastercard se visualizan correctamente en el detalle de la transacción reclamada.\nFecha de creación: 2024-02-29\nNº ID: 21\nMódulo: Visualización de Detalle de Transacción\nPrioridad: Media\nStatus: Por hacer\nResultado esperado: Al visualizar el detalle de una transacción Visa o Mastercard, los campos específicos de cada marca (ej: Field 22/ DE022 – Modo de Entrada de la Trx) deben mostrarse con su descripción correspondiente.\nPaso a paso de la prueba:\n1. Seleccionar una transacción Visa.\n2. Verificar que los campos específicos de Visa se muestran correctamente con su descripción.\n3. Seleccionar una transacción Mastercard.\n4. Verificar que los campos específicos de Mastercard se muestran correctamente con su descripción.\n\nCP-22: Validar la trazabilidad completa de acciones\nDescripción: Validar que el sistema registra todas las acciones realizadas por los usuarios en el sistema.\nFecha de creación: 2024-02-29\nNº ID: 22\nMódulo: Auditoría\nPrioridad: Alta\nStatus: Por hacer\nResultado esperado: El sistema debe contar con un módulo de auditoría que registre todas las acciones realizadas por los usuarios, incluyendo: inicio de sesión, creación, modificación y eliminación de reclamos, cambios de estado, asignación de analistas, etc.\nPaso a paso de la prueba:\n1. Realizar diferentes acciones en el sistema (ej: iniciar sesión, crear un reclamo, modificar un reclamo, cambiar el estado de un reclamo).\n2. Acceder al módulo de auditoría.\n3. Verificar que todas las acciones realizadas se registran correctamente en el módulo de auditoría, incluyendo la fecha y hora, el usuario que realizó la acción y los detalles de la misma.\n\nCP-23: Validar la parametrización de reglas por entidad, marca y vencimientos\nDescripción: El sistema debe permitir la parametrización de reglas específicas por entidad, marca y vencimientos.\nFecha de creación: 2024-02-29\nNº ID: 23\nMódulo: Administración Referenciales\nPrioridad: Alta\nStatus: Por hacer\nResultado esperado: Un administrador debe poder configurar diferentes reglas para cada entidad y marca, incluyendo los plazos de vencimiento para la presentación de contracargos.\nPaso a paso de la prueba:\n1. Ingresar al sistema con un usuario con rol de administrador.\n2. Navegar a la sección de administración de reglas.\n3. Configurar diferentes reglas para diferentes entidades y marcas, incluyendo los plazos de vencimiento.\n4. Crear reclamos para diferentes entidades y marcas.\n5. Verificar que el sistema aplica las reglas configuradas correctamente para cada entidad y marca.\n\nCP-24: Validar la asignación equitativa de casos a analistas\nDescripción: Verificar que el sistema distribuye los casos de forma equitativa entre los analistas disponibles para una misma entidad/marca.\nFecha de creación: 2024-02-29\nNº ID: 24\nMódulo: Asignación automática\nPrioridad: Alta\nStatus: Por hacer\nResultado esperado: Al crear un nuevo reclamo, el sistema debe asignar el caso al analista con menos casos asignados dentro de la entidad/marca correspondiente.\nPaso a paso de la prueba:\n1. Configurar el sistema con varios analistas asignados a una misma entidad/marca.\n2. Crear varios reclamos para esa entidad/marca.\n3. Verificar que los reclamos se asignan a los diferentes analistas de forma equitativa.\n\nCP-25: Validar la integridad y precisión de los reportes y dashboards\nDescripción: Verificar que los reportes y dashboards generados por el sistema son precisos y reflejan el estado real de los casos.\nFecha de creación: 2024-02-29\nNº ID: 25\nMódulo: Reportes y Dashboards\nPrioridad: Alta\nStatus: Por hacer\nResultado esperado: Los reportes y dashboards deben mostrar información precisa sobre el estado de los casos, los tiempos de respuesta, la resolución de reclamos y otras estadísticas relevantes.\nPaso a paso de la prueba:\n1. Crear varios reclamos en diferentes estados.\n2. Generar los reportes y dashboards correspondientes.\n3. Verificar que la información mostrada en los reportes y dashboards coincide con el estado real de los casos.\n4. Verificar que los cálculos de tiempos de respuesta y otras estadísticas son correctos.\n",
      "fue_ia": true
    }
  ],
  "fin": "2025-08-08T14:56:58.234252",
  "total_mensajes": 1
}