{
  "inicio": "2025-08-08T15:21:11.975258",
  "conversaciones": [
    {
      "timestamp": "2025-08-08T15:21:47.682732",
      "usuario": "Generame un manual de usuario de bepsa porfavor",
      "bot": "¡Claro! Con gusto te ayudaré a generar un manual de usuario para Bepsa.  Para que sea lo más útil posible, necesito que me proporciones información sobre:\n\n*   **¿Qué es Bepsa?**  Una breve descripción del sistema (¿es un CRM, un ERP, una plataforma de gestión de proyectos, etc.?)\n*   **¿Cuál es el objetivo principal de Bepsa?** ¿Qué problema resuelve o qué necesidad satisface?\n*   **¿Cuáles son los módulos principales del sistema?** Nombres de cada uno y una breve descripción de su función.\n*   **¿Cuáles son las funcionalidades más importantes dentro de cada módulo?**\n\nCuanto más detallada sea la información que me proporciones, mejor podré estructurar y redactar el manual.  \n\nMientras tanto, te puedo ofrecer el esquema básico para que lo vayas revisando:\n\n**Documentación de Usuario**\n**BEPSA**\n\n[LOGO O IMAGEN SI CORRESPONDE]\n\n**ÍNDICE**\n\n1.  Introducción\n    1.1. Objetivo del Proyecto\n    1.2. Descripción General del Sistema\n2.  Guía de Usuario\n    2.1. Iniciar Sesión\n    2.2. Menú Principal del Usuario\n3.  Módulo [Nombre 1]\n    3.1. Descripción\n    3.2. [Funcionalidad 1]\n    3.3. [Funcionalidad 2]\n4.  Módulo [Nombre 2]\n    4.1. Descripción\n    4.2. [Funcionalidad 1]\n    4.3. [Funcionalidad 2]\n[... continuar con todos los módulos]\n\n¡Espero tu información para empezar a construir el manual!\n",
      "fue_ia": true
    },
    {
      "timestamp": "2025-08-08T15:24:00.823868",
      "usuario": "Esta informacion tengo:\n\n\n\nDocumentación de Usuario \n\nCRM-Bepsa\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIntroducción\nObjetivo del Proyecto\nDescripción General del Sistema\nGuia de Usuario\nIniciar Sesión \nMenu Principal del Usuario \nMódulo Entidades\nCaso de Uso: Crear una Nueva Entidad en el Módulo Entidades\nCaso de Uso: visión integral de la entidad\nCaso de Uso: Filtro de entidades\nMódulo Comercio\nCaso de Uso: Crear un Nuevo Comercio en el Módulo Comercios\nCaso de Uso: visión integral del Comercio\nCaso de Uso: Filtro de comercios\nMódulo Casos\nDescripción de cada apartado al Crear/Editar Caso\nCasos de Uso - Módulo de Casos\nCasos de Uso - Módulo de Casos\nCrear un nuevo caso en la vista kanban\nCaso de Uso: Vista detalle del Caso\nCasos de usos específicos en el módulo casos\nMódulo Tipificaciones\nDescripción Tipificaciones\nCasos de Uso en el Módulo Tipo\nCaso de Uso: Crear un nuevo Tipo\nCasos de Uso en el Módulo Subtipo\nCaso de Uso: Crear un nuevo Subtipo\nCasos de Uso en el Módulo Tipificación\nCaso de Uso: Crear una nueva tipificación\nCasos de Uso en el Módulo Combinaciones\nCaso de Uso: Crear una nueva Combinación\nMódulo Seguridad\nDescripción Seguridad \n1. Módulo de Grupos\nDescripción Grupos\nCasos de Uso\nCrear Grupo\n\nEditar Grupo\n2. Módulo de Usuarios\nEditar Usuario\nMódulo Áreas de Resolución\nCaso de Uso: Crear una nueva área de resolución en el Módulo Áreas de resolución.\nMódulo Configuración\nCaso de Uso: Editar los datos de la configuración.\nMódulo Fases\nCrear una nueva fase\nMódulo de Funcionarios\nAñadir un nuevo funcionario\nCaso de Uso: Crear un nuevo funcionario en el módulo Funcionario.\neditar información de los funcionarios\nMódulo de Módulos\nDescripción Módulos\nMódulo Permisos\n Vista de Alta\nVista de Edición\nVista de Lista\nMódulo Tablero\nCaso de Uso: Visualizar Datos Diarios en el Módulo Tablero\nMódulo Solicitudes\nMódulo Materiales\nCaso de Uso: Crear un nuevo Material\nMódulo Kit de bienvenida\nCaso de Uso: Crear un nuevo Kit de bienvenida\nMódulo Soporte tecnico\nCaso de Uso: Crear un nuevo Soporte Técnico\nMódulo Bobinas\nCaso de Uso: Crear pedidos de bobinas\nMódulo Insumos\nCaso de Uso: Crear pedidos de Insumos\n\n\n\n\n\n\n\n\nIntroducción\nObjetivo del Documento\nEl objetivo de este documento es proporcionar una guía completa sobre el uso y administración del sistema de CRM-Bepsa.\nDescripción General del Sistema\nEl sistema CRM-Bepsa está diseñado para optimizar la gestión de relaciones con entidades y comercios, proporcionando una plataforma integral que facilita el seguimiento de interacciones, la resolución de casos y la administración eficiente de procesos clave. Con un enfoque centralizado, CRM-Bepsa asegura una supervisión detallada de las actividades, permitiendo a los usuarios gestionar cada entidad y comercio de manera personalizada y efectiva.\nDesde la apertura de casos hasta su resolución, CRM-Bepsa garantiza que cada proceso se maneje de forma ágil, mejorando la eficiencia operativa y fortaleciendo las relaciones comerciales.\n\nGuia de Usuario\nIniciar Sesión\n\nPantalla de inicio de sesión:\n\n\n\nCompletar con los datos requeridos:\n\n\n\n\n\n\n\n\n\n\n\n\n\nMenu principal del Usuario\nPantalla principal del CRM-Bepsa:\n\n\n\n\n\n\n\nMódulo Entidades:\nDescripción: Gestión de entidades individuales y sus detalles.\nCasos de Uso:\nAñadir una nueva entidad: Proceso para agregar una nueva entidad al sistema.\nVisión integral de la entidad: Visualización de la entidad, mostrando los datos más relevantes, los casos activos, cuentas, productos y servicios.\nFiltro de entidades: Filtrar por ruc, nombre, código cliente y vendedor de la entidad creada\nCaso de Uso: Crear una Nueva Entidad en el Módulo Entidades\nActor: Usuario del CRM-Bepsa\nPrecondiciones: \n- El usuario debe estar autenticado en el sistema.\n- El usuario debe contar con los permisos adecuados\nDescripción: Este caso de uso describe cómo un usuario puede crear una nueva Entidad en el sistema CRM-Bepsa.\nPasos:\n1. El usuario navega al módulo de Entidades.\n\n\n\n\n\n\n\n\n\n2. Selecciona el botón \"Crear Entidad\".\n\n\n3. Rellena el formulario con los datos de la Entidad: \nCampos Obligatorios:\nRUC\nNombre\nRazón Social\nEmail\nDirección\nComercio Asignado\n\n\n\n\n\n\n4. Seleccionar el botón de “Agregar Sucursal” en la creación de Entidad.\n\n\n\n5. Rellena el formulario con los datos de la Sucursal: \nCampos Obligatorios:\nNro.Cliente\nNombre\nEmail\nCiudad\nComercio Asignado\n\n\nTocar el botón de “Guardar” la Sucursal.\n\n\n\n\n\n\n\n\n\nTocar el botón de “Guardar” la Entidad.\n\n\n\n\n\n\n\n\n\n\nPostcondiciones: La nueva entidad aparece en la vista lista del módulo de Entidades y está disponible en el formulario de casos como un cliente/ Entidad.\nVista lista de Entidades:\n\n\n\n\n\n\nFormulario de creación de Casos en el módulo de casos: \n\n\nCaso de Uso: visión integral de la entidad\nDescripción: Visualización de la entidad, mostrando los datos más relevantes, los casos activos, cuentas, productos y servicios.\nActor: Usuario del CRM-Bepsa\nPrecondiciones: El usuario debe estar autenticado en el sistema y tener permisos para ver detalles de la Entidad.\nPasos:\nEl usuario navega al Módulo de Entidades.\n\n\n\n\n\n\n\n\nSelecciona la entidad para ver su detalle y haz clic en el icono del ojito que lleva a la visión integral de la Entidad.\n\n\n\n\n\n\n\n\nVisión Integral:\n\n\nvisión integral de la entidad incluye:\nDatos Personales: Información básica como nombre, teléfono, sucursal, ruc, Nro de cuenta, vendedor, tipo cliente, etc.\nCasos Activos: Lista de casos activos de tipo “Reclamos”, “Solicitudes”, “Denuncias” y “otros” asociadas con la entidad,  con detalles como el Nro.Ticket, Tipo, Subtipo, Tipificación, Asunto, Fecha/Hora creacion y estado.\nEjemplo de los Datos Personales:\n\n\n\n\nEjemplo de los casos activos:\n\n\n\n\n\n\n\n\n\nReclamos:\n\nOtros:\n\nCrear  Caso: Permite al usuario generar un nuevo caso relacionado con la entidad.\n\n\n\n\n\n\n\n\n\nCaso de Uso: Filtro de entidades\nDescripción: Filtrar por ruc, nombre y vendedor de la entidad creada\nActor: Usuario del CRM-Bepsa\n\nPrecondiciones: El usuario debe estar autenticado en el sistema y tener permisos para filtrar por un dato de la Entidad.\nEl usuario navega al módulo de Entidades.\n\n\nSeleccionar el botón “filtro” de la Entidad. \n\nFiltramos por Ruc.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFiltramos por el Nombre.\n\n\n\nFiltramos por el vendedor.\n\n\n\n\n\n\n\n\n\n\nMódulo Comercio:\nDescripción: Gestión de Comercios individuales y sus detalles.\nCasos de Uso:\nAñadir un nuevo Comercio: Proceso para agregar un nuevo comercio al sistema..\nvisión integral del Comercio: Visualización del comercio, mostrando los datos más relevantes, los casos activos, cuentas, productos y servicios.\n\nFiltro de comercio: Filtrar por ruc, nombre y vendedor del comercio creado\nCaso de Uso: Crear un Nuevo Comercio en el Módulo Comercios\nActor: Usuario del CRM-Bepsa\nPrecondiciones: \n- El usuario debe estar autenticado en el sistema.\n- El usuario debe contar con los permisos adecuados\nDescripción: Este caso de uso describe cómo un usuario puede crear un nuevo Comercio en el sistema CRM-Bepsa.\nPasos:\n1. El usuario navega al módulo de comercios.\n\n2. Selecciona el botón \"Crear Comercio\".\n\n\n\n\n\n\n\n3. Rellena el formulario con los datos de la Entidad: \nCampos Obligatorios:\nRUC\nNombre\nRazón Social\nEmail\nDirección\nComercio Asignado\n\n\n\n\n\n4. Seleccionar el botón de “Agregar Sucursal” en la creación de un comercio.\n\n\n\n5. Rellena el formulario con los datos de la Sucursal: \nCampos Obligatorios:\nNro.Cliente\nNombre\nEmail\nCiudad\nComercio Asignado\n\n\n\n\n\nTocar el botón de “Guardar” la Sucursal.\n\n\n\nTocar el botón de “Guardar” El comercio.\n\n\n\n\n\n\n\n\nPostcondiciones: El nuevo Comercio aparece en la vista lista del módulo Comercio y está disponible en el formulario de casos como un cliente/ Comercio.\nVista lista de Comercios:\n\n\n\n\n\n\nFormulario de creación de Casos en el módulo de casos: \n\n\nCaso de Uso: visión integral del Comercio\nDescripción: Visualización del comercio, mostrando los datos más relevantes, los casos activos, cuentas, productos y servicios.\nActor: Usuario del CRM-Bepsa\nPrecondiciones: El usuario debe estar autenticado en el sistema y tener permisos para ver detalles del comercio.\n\n\nPasos:\nEl usuario navega al Módulo de Comercios.\n\nSelecciona el comercio para ver su detalle y haz clic en el icono del ojito que lleva a la visión integral del Comercio.\n\nVisión Integral:\n\n\n\n\n\n\nvisión integral del comercio incluye:\nDatos Personales: Información básica como nombre, teléfono, sucursal, ruc, Nro de cuenta, vendedor, tipo cliente, etc.\nCasos Activos: Lista de casos activos de tipo “Reclamos”, “Solicitudes”, “Denuncias” y “otros” asociados con el comercio,  con detalles como el Nro.Ticket, Tipo, Subtipo, Tipificación, Asunto, Fecha/Hora creacion y estado.\nEjemplo de los Datos Personales:\n\n\n\n\n\nEjemplo de los casos activos:\n\nOtros:\n\n\n\n\n\n\n\n\nCrear  Caso: Permite al usuario generar un nuevo caso relacionado con el comercio.\n\n\n\n\n\n\n\n\n\n\nCaso de Uso: Filtro de comercios\nDescripción: Filtrar por ruc, nombre y vendedor del comercio creado\nActor: Usuario del CRM-Bepsa\n\nPrecondiciones: El usuario debe estar autenticado en el sistema y tener permisos para filtrar por un dato del comercio.\nEl usuario navega al módulo de comercio.\n\n\n\nSeleccionar el botón “filtro” del Comercio.\n\nFiltramos por Ruc. \n\n\n\n\n\n\n\n\n\nFiltramos por el Nombre.\n\n\n\n\n\n\n\n\n\n\nFiltramos por el vendedor.\n\n\n\n\n\n\n\n\n\n\n\nMódulo Casos:\nDescripción: El Módulo de Casos está diseñado para gestionar y rastrear las interacciones y solicitudes de los clientes, que pueden ser tanto contactos individuales como empresas. Este módulo permite a los usuarios del CRM-Bepsa crear, editar, asignar, visualizar y cerrar casos relacionados  de los clientes ya sean problemas, solicitudes, denuncias, etc. Es una herramienta fundamental para la resolución eficiente de problemas y para mantener un historial detallado de todas las interacciones con los clientes.\nDescripción de cada apartado al Crear/Editar Caso\nCliente:\nSeleccionar un tipo de cliente,  de Entidad  o Comercio.\nDatos del cliente:\nNro.Documento Cliente/Ruc: Campo que se autocompleta dependiendo del cliente elegido \nSucursal del Cliente: Campo que que está relacionado dependiendo del cliente elegido \nTeléfono:Campo que se autocompleta dependiendo del cliente elegido \n\nDatos de la Entidad: \nNombre de la entidad: Nombre de la entidad creada que maneja el caso \nTeléfono de la entidad:Número de teléfono de la entidad\nNro. Documento: Número de identificación de la entidad\nClasificación del caso: \nTipo: Categoria principal del caso, que define el tipo de interacción que pueden ser “Entidad y Comercio” que están relacionado por el cliente elegido\nSubtipo: Subcategoría del tipo de caso, que define el subtipo de interacción o problema reportado por el cliente (las opciones son basadas en el tipo )\nTipificación:Clasificación detallada del caso,que especifica más detalladamente la naturaleza del problema o solicitud (las opciones son basadas en el subtipo)\nCasos de Uso - Módulo de Casos\nCrear un nuevo caso en la vista lista\nDescripción: Proceso para crear un nuevo caso asociado a un cliente, que puede ser una entidad o comercio\nActor: Usuario del CRM-Bepsa\nPrecondiciones: El usuario debe estar autenticado en el sistema y debe contar con los permisos adecuados.\nPasos:\nEl usuario navega al módulo de Casos y selecciona la opción \"Crear Caso\".\n\n\n\n\n\n\n\n\n\n\n2. Indica si el cliente es una entidad o comercio, luego busca y selecciona la entidad o comercio correspondiente.\n\n\n\n\n\n\n\n3. Completa el formulario con la información del caso, incluyendo la clasificación del caso  (Tipo,Subtipo,Tipificación), asunto, origen del caso, estado, áreas resolutoras.\n\n\n\n\n\n\n\n\n\n\n\n\n\n4. En la creación de un caso tienes la opción de adjuntar archivos.\n\n5. Guarda el nuevo caso.\n\n\n\n\n\n\nPostcondiciones: El nuevo caso aparece en la vista lista, kanban  y está disponible para su seguimiento y resolución.\nVista Lista:\n\n\n\n\n\nCasos de Uso - Módulo de Casos\nCrear un nuevo caso en la vista kanban\nDescripción: Proceso para crear un nuevo caso asociado a un cliente, que puede ser una entidad o comercio.\nActor: Usuario del CRM-Bepsa\nPrecondiciones: El usuario debe estar autenticado en el sistema y debe contar con los permisos adecuados.\nPasos : \nEl usuario navega por el módulo casos y hace click en el botón Vista Kanban.\n\nEl usuario hace click en el botón Crear Caso.\n\n\n\n\n\n\n\n\n\nObservación: La creación del caso desde la vista kanban funciona de la misma forma que en la vista lista\n\nCaso de Uso: Vista detalle del Caso\nDescripción: Visualización de una vista detallada del caso, mostrando los datos más relevantes.\nActor: Usuario del CRM-Bepsa \nPrecondiciones: El usuario debe estar autenticado en el sistema y tener permisos para ver detalles del caso.\nPasos : \nEl usuario navega por el módulo casos y hace click en el icono del ojito.\n\n\n\n\n\n\n\nVisualización del detalle del caso \n\n\n\n\n\n\n\n\nSección de notas dentro del detalle del caso.\n\nSección Historial de estado : Se muestra un historial de los estados en los que se encontró el caso.\n\n\n\n\n\nSección archivos adjuntos \n\n\n\n\n\n\n\nCaso de Uso: Vista detalle del Caso (Cronología)\nDescripción: Visualización de una vista detallada del caso, la modificación de campos específicos se muestra en el apartado de cronología, un historial de cambio.\n Actor: Usuario del CRM-Bepsa \nPrecondiciones: El usuario debe estar autenticado en el sistema y tener permisos para ver detalles del caso.\nPasos : \nEl usuario navega por la vista detalle del caso y hace click en el botón Cronología.\n\nCampos que se muestran en el historial :\nResolución a favor del cliente \nComentario del cierre del caso \nSolución \nÁrea resolutora\nEstado del caso \nOrigen del caso \nMonto\nMoneda del caso \nDescripción\nAsunto \nCliente\nTipificación\n\nCaso de Uso: Filtro de tipo\nDescripción: Funcionalidad que permite filtrar los casos según los tipos de cliente en la vista de lista.\n Actor: Usuario del CRM-Bepsa \nPrecondiciones: El usuario debe estar autenticado en el sistema y tener permisos para ver detalles del caso.\nPasos : \nEl usuario navega al módulo de Casos y toca el botón de “Tipo”.\n\n\n\n\n\nCaso de Uso: Botón de Exportar\nDescripción: Funcionalidad que permite exportar todos los casos o, en su defecto, los resultados filtrados según los criterios aplicados en la vista lista.\n Actor: Usuario del CRM-Bepsa \nPrecondiciones: El usuario debe estar autenticado en el sistema y tener permisos para ver detalles del caso.\nPasos : \nEl usuario navega al módulo de Casos y toca el botón de “Exportar”.\n\n\n\n\n\n\n\n\n\n\n\nAl ingresar un filtro se exportan los casos que aparecen en la tabla de la vista lista.\n\n\n\n\n\n\n\n\nCasos de usos específicos en el módulo casos:\nEn el apartado “Resolutores del caso” el campo “Vendedor ” se autocompleta dependiendo del cliente seleccionado.\n\n\n\n\n\n\n\n\n\nEn la creación y edición no permite ingresar datos sensibles en la descripción.\n\n\n\n\n\n\n\nEn notas esta la validación de que no permite datos sensibles\n\n\n\n\n\n\nEstas son las validaciones y combinaciones que no te permite:\nCaracteres que bloquea en este estos patrones:\nXXXX-XXXX-XXXX-XXXX\nXXXX XXXX XXXX XXXX\nXXXXXXXXXXXXXXXX                 \t\nson:  O-I-Z-E-A-S-G-T-B-l-q-P \n\n\n\nEn la edición del módulo de casos, se agrega una restricción que permite la edición solo a las áreas o personas resolutoras y al propietario del caso.\n\n\n\n\n\n\n\n\nMódulo Tipificaciones:\nDescripción Tipificaciones: \nEn el  módulo de Tipificaciones se clasifican y organizan diferentes tipos de interacciones mediante una estructura jerárquica de Tipo, Subtipo y Tipificación. Esta categorización facilita la gestión y mejora la eficiencia operativa.\n\n\n\n1.Tipo\nDescripción:  Categoria principal del caso, que define el tipo de interacción que pueden ser “Entidad y Comercio” que están relacionado por el cliente elegido\n2.Subtipo\nDescripción: Subcategoría del tipo de caso, que define el subtipo de interacción o problema reportado por el cliente (las opciones son basadas en el tipo )\nUso en el Sistema: Los subtipos proporcionan un nivel de detalle, permitiendo a los usuarios refinar y especificar mejor la naturaleza de las interacciones.\n\n2.Tipificación\nDescripción: Clasificación detallada del caso,que especifica más detalladamente la naturaleza del problema o solicitud (las opciones son basadas en el subtipo)\n\nCasos de Uso en el Módulo Tipo\nCaso de Uso: Crear un nuevo Tipo\nActor: Usuario del CRM-Bepsa\nPrecondiciones:\nEl usuario debe estar autenticado en el sistema.\nEl usuario debe contar con los permisos adecuados\nDescripción: Este caso de uso describe cómo un usuario puede crear un nuevo tipo en el sistema.\nPasos a Seguir:\nAcceder al Módulo Tipos: El usuario navega hasta el módulo de Tipos en el menú principal.\n\n\n\n2. Dar click en el botón Crear Tipo.\n\n3.Completar el nombre del tipo y guardar \n\n\n\n\n\n\n\n\n\n4. El nuevo tipo debe visualizarse en el formulario de creación/edición del módulo casos teniendo en cuenta que dependiendo del cliente seleccionado este campo se completa automáticamente.\n \n\nExcepciones a tener en cuenta en la creación de tipo: \nNo se pueden crear tipos con el mismo nombre \n\n\n\nCasos de Uso en el Módulo Subtipo\nCaso de Uso: Crear un nuevo Subtipo\nActor: Usuario del CRM-Bepsa\nPrecondiciones:\nEl usuario debe estar autenticado en el sistema.\nEl usuario debe contar con los permisos adecuados.\nDescripción: Este caso de uso describe cómo un usuario puede crear un nuevo subtipo en el sistema.\nPasos a Seguir:\nAcceder al Módulo Subtipo: El usuario navega hasta el módulo de Subtipos en el menú principal.\n\n\n\n\n\n\n\nDar click en el botón Crear Subtipo.\n\nCompletar el nombre del subtipo y guardar. \n\nCasos de Uso en el Módulo Tipificación\nCaso de Uso: Crear una nueva tipificación\nActor: Usuario del CRM-Bepsa\n\n\n\nPrecondiciones:\nEl usuario debe estar autenticado en el sistema.\nEl usuario debe contar con los permisos adecuados.\nDescripción: Este caso de uso describe cómo un usuario puede crear una nueva tipificación en el sistema.\nPasos a Seguir:\nAcceder al Módulo Tipificación: El usuario navega hasta el módulo de tipificaciones en el menú principal.\n\nDar click en el botón Crear Tipificación.\n\n\nCompletar el nombre de la tipificación y guardar.\n\nCasos de Uso en el Módulo Combinaciones\nCaso de Uso: Crear una nueva Combinación\nActor: Usuario del CRM-Bepsa\nPrecondiciones:\nEl usuario debe estar autenticado en el sistema.\nEl usuario debe contar con los permisos adecuados.\nDescripción: Este caso de uso describe cómo un usuario puede crear una nueva combinación en el sistema.\nPasos a Seguir:\n1.Acceder al Módulo Combinaciones: El usuario navega hasta el módulo de Combinaciones en el menú principal.\n\n\n\n\n\n\n2. Dar click en el botón Crear Combinaciones \n\n3. Completar los campos tipo y subtipo, luego guardar. \n\n\n\n\n\n\n\n\n\nObs: \nLa combinación creada se muestra en el formulario de creación/edición del módulo casos.\nNo se pueden crear combinaciones que ya existen.\nEl tipo y el subtipo creado previamente se muestran entre las opciones.\n \nMódulo Seguridad\nDescripción Seguridad:\nEl módulo de seguridad se encarga de gestionar los accesos y permisos de los usuarios mediante dos submódulos principales: Grupos y Usuarios. Estos submódulos trabajan en conjunto para asegurar que cada usuario tenga los permisos adecuados según su rol.\n\n\n\n\n\n\n\n\n\n\n\n\n\n1. Módulo de Grupos\nDescripción Grupos:\nEl módulo de Grupos permite la creación y gestión de roles. Un rol define un conjunto de permisos que pueden ser asignados a uno o más usuarios.\n\nCasos de Uso: Crear grupo\nCrear Grupo: Permite definir un nuevo grupo especificando los permisos asociados.\n\n\n\nEditar Grupo: Permite modificar el grupo, estado, el módulo y los permisos asignados a un grupo existente.\n\n\n\n\n\n2. Módulo de Usuarios\n\nDescripción: El módulo de Usuarios permite la gestión de usuarios.\nCaso de Uso: Crear un Usuario en Keycloak para Sincronización con el CRM-Bepsa\nActor: Usuario del CRM-Bepsa.\nPrecondiciones:\nEl usuario debe estar autenticado en Keycloak con permisos de administrador.\nDebe existir un grupo en Active Directory (AD) para sincronizar los usuarios.\nDescripción: Este caso de uso detalla los pasos necesarios para configurar Keycloak y permitir la sincronización de nuevos usuarios mediante LDAP, asegurando que puedan ser utilizados en el sistema CRM-Bepsa.\nPasos a Seguir:\nSeleccionar el reino correspondiente: Navegar al reino \"crm-bepsa\" en Keycloak.\n\n\n\nAcceder a Federación de Usuarios: Ir a la sección \"Federación de Usuarios\" dentro del menú de configuración.\n\nSeleccionar LDAP: Hacer clic en la opción LDAP para acceder a la configuración.\n\nGuardar el Filtro LDAP actual: En la sección Configuraciones de búsqueda y actualización LDAP, copiar el contenido del cuadro Filtro LDAP de usuario y guardarlo en un bloc de notas como respaldo.\n\n\n\n\n\nObtener la configuración de un grupo existente: Copiar un bloque de uno de los grupos ya configurados, como se muestra en la imagen de referencia.\n\n\nEditar el bloque copiado:\nAñadir un espacio al final del bloque.\nPegar el texto copiado anteriormente en el bloc de notas.\n\nReemplazar el nombre del grupo existente por el nuevo.\n\n\n\n\nActualizar el Filtro LDAP de usuario:\nSeleccionar todo el texto editado en el bloc de notas y pegarlo nuevamente en el cuadro Filtro LDAP de usuario.\n\n\nGuardar los cambios realizados.\n\n\nConfigurar los Mapeadores:\nUna vez que los cambios se hayan guardado con éxito, acceder a la ficha Mapeadores.\n\nSeleccionar grupo y editar la configuración.\n\nModificar el filtro en los Mapeadores:\nEn la sección LDAP Filter, copiar el texto existente y guardarlo en un bloc de notas.\n\n\n\n\nModificar la última línea del filtro según las instrucciones indicadas en la imagen de referencia.\n\n\n\nReemplazar el texto necesario por el nombre del grupo que se desea agregar.\n\nAplicar los cambios al filtro:\nSeleccionar todo el texto editado y pegarlo nuevamente en el cuadro de texto LDAP Filter en Keycloak.\n\n\n\n\n\nDesplazarse hacia abajo en la ventana y guardar los cambios.\n\n\nVerificar la sincronización con Active Directory (AD):\nUna vez sincronizado con el AD, el nuevo grupo aparecerá en la lista.\n\n\n\n\n\n\n\n\nConfigurar los Atributos del Grupo:\nSeleccionar el grupo creado, dirigirse a la ficha Atributos y agregar el siguiente valor:\nClave: system\nValor: admin\n\n\n\n\n\n\n\n\n\n\nGuardar los cambios realizados.\n\n\n\n\n\n\n\nPostcondiciones:\nEl nuevo grupo será visible y sincronizado correctamente en Keycloak.\nLos usuarios dentro del grupo tendrán acceso al CRM-Bepsa según las configuraciones establecidas.\n\nNota:\nCon estos pasos, se asegura la correcta sincronización de los nuevos usuarios dentro del grupo creado en AD, permitiendo su uso en el sistema CRM-Bepsa.\n\n\nCaso de Uso: Editar Usuario\nActor: Usuario del CRM-Bepsa.\nPrecondiciones:\n- El usuario debe estar autenticado en el sistema.\n- El usuario debe contar con los permisos adecuados\nDescripción: Permite al Administrador del Sistema modificar la información de un usuario registrado y lo que puede modificar es la sucursal.\nPasos a Seguir:\nEl Administrador accede al módulo \"Usuarios\" desde el menú principal.\n\n\n\n\n\n\n\n\n\nEditar Usuario: Permite modificar la sucursal de un usuario.\n\nMódulo Áreas de Resolución:\nDescripción: Creación de Áreas de resolución\nCasos de Uso:\nAñadir una nueva Áreas de Resolucion: Proceso para agregar una nueva área de resolución.\neditar información del Área de resolución: Modificación de datos existentes.\n\nCaso de Uso: Crear una nueva área de resolución en el Módulo Áreas de resolución.\nActor: Usuario del CRM-Bepsa\nPrecondiciones: \n- El usuario debe estar autenticado en el sistema.\n- El usuario debe contar con los permisos adecuados\n\nDescripción: Este caso de uso describe cómo un usuario puede crear una nueva área de resolución en el sistema CRM-Bepsa.\nEl cliente debe ingresar al módulo Áreas de Resolución.\n\nDebe seleccionar el botón “Crear Áreas Resolutoras”.\n\n\n\n\n\n\n\n\n\nCompletar con los datos obligatorios.\n\n\n\n\n\n\n\n\n\n\nEl cliente tiene la opción de editar las áreas de resolución.\n\n\n\n\n\n\n\n\n\n\nEn el módulo áreas de resolución tienes un filtro para buscar por áreas resolutoras.\n\nDatos Adicionales:\nLos datos del módulo áreas de resolución se visualizan en el modulo Casos\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMódulo Configuración:\nDescripción: Edición del módulo configuración\nCasos de Uso:\nCaso de Uso: Editar los datos de la configuración.\nEditar información de la configuración: Modificación de datos existentes.\nActor: Usuario del CRM-Bepsa\nPrecondiciones: \n- El usuario debe estar autenticado en el sistema.\n- El usuario debe contar con los permisos adecuados\n\nDescripción: Este caso de uso describe cómo un usuario puede editar la configuración en el sistema CRM-Bepsa.\nEl cliente debe ingresar al módulo configuración.\n\nEl cliente tiene la opción de editar las configuraciones.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMódulo Fases:\nDescripción: Actualmente el módulo de Fases gestiona las diferentes etapas que atraviesan los casos en el CRM-Bepsa. Las fases actúan como estados que reflejan el progreso de la oportunidad a través del ciclo de ventas.\nCasos de Uso:\nCrear una nueva fase: Proceso para agregar una nueva fase en el ciclo de una oportunidad.\n\nEditar una fase existente: Modificación de los datos de una fase, incluyendo Asignación de pasos, nombre y código \n\n\n\nVista Kanban de Casos: Visualización de los casos organizadas por fases.\n\n\n\n\n\n\n\n\n\nMódulo de Funcionarios:\nDescripción: Creación de funcionarios\nCasos de Uso:\nAñadir un nuevo funcionario: \nProceso para agregar un nuevo funcionario.\nCaso de Uso: Crear un nuevo funcionario en el módulo Funcionario.\neditar información de los funcionarios:\n Modificación de datos existentes.\nActor: Usuario del CRM-Bepsa.\nPrecondiciones: \n- El usuario debe estar autenticado en el sistema.\n- El usuario debe contar con los permisos adecuados\n\nDescripción: Este caso de uso describe cómo un usuario puede crear un nuevo funcionario en el sistema CRM-Bepsa.\nEl cliente debe ingresar al módulo de Funcionarios.\n\n\n\nDebe ingresar en el botón de Crear Funcionario.\n\n3. Completar todos los datos obligatorios.\n\n\n\n\n\n\n\n\n\n4. El cliente tiene la opción de editar algunos datos del funcionario.\n\n\n\n\n\n\n\n\n\n\n5. Tienes un buscador que puedes buscar por el nombre del funcionario.\n\n\n\n\n\n\n\n\n\n\n\nMódulo de Módulos:\nDescripción Módulos: \nEl módulo de Módulos permite la gestión de los diferentes módulos del CRM-Bepsa, con detalles como código, nombre, y URL de cada módulo. Este módulo facilita la administración de los módulos disponibles en el sistema.\n\nAlta del módulo: El usuario navega al módulo \"Módulos\" y selecciona la opción de \"Crear módulo\".\nCampos de Entrada:\nCódigo: Se ingresa el código único del módulo.\nNombre: Se asigna un nombre descriptivo al módulo.\nURL: Se define la URL asociada al módulo.\n\n\n\n\n\nEditar módulo.\n\nVista Lista.\n\n\n\n\n\n\n\n\n\nMódulo Permisos:\nDescripción: El módulo de permisos permite gestionar y controlar el acceso de los usuarios a diferentes funcionalidades y secciones del sistema.\n\nCasos de Uso:\n Vista de Alta:\nLa vista de alta es utilizada para crear nuevos permisos en el sistema. En esta vista, los usuarios deben ingresar la siguiente información:\nNombre del Permiso:  Seleccionar el nombre del permiso, utilizando un menú desplegable con los permisos que aún no se agregaron al sistema.\nMódulo: Seleccionar el módulo al que el nuevo permiso se aplicará.\nURL: Definir la URL asociada al nuevo permiso.\n\n\n\n\n\n\nVista de Edición:\nLa vista de edición permite modificar los permisos existentes. En esta vista, los usuarios pueden realizar los siguientes cambios:\nNombre del Permiso: El campo se inhabilita.\nMódulo: Seleccionar el módulo al que se aplica el permiso, utilizando un menú desplegable que muestra los módulos disponibles en el sistema.\nURL: Actualizar la URL asociada al permiso si es necesario.\n\n\n\n\n\nVista de Lista:\nLa vista de lista proporciona una visión general de todos los permisos configurados en el sistema. En esta vista, se pueden observar los siguientes campos:\nNombre del permiso: El nombre descriptivo del permiso, que indica la acción o el acceso que otorga.\nMódulo: El módulo del sistema al que se aplica el permiso. Esto ayuda a clasificar los permisos según la funcionalidad o área del CRM-Bepsa a la que corresponden.\nURL: La dirección o ruta dentro del sistema a la que se refiere el permiso, facilitando el acceso directo a la funcionalidad asociada.\n\n\nCon cuál módulo se relacionan los permisos creados? \nSe relacionan con el módulo de grupos \n\n\n\n\n\n\n\n\n\nMódulo Tablero: \nDescripción: Visualización y análisis de métricas del CRM-Bepsa a través de totales, organizados en vistas diarias.\nCasos de Uso:\nVisualizar datos diarios: Presentar totales de casos, entidad y comercio registrados con filtros por último día, últimos 7 días, últimos 15 días y últimos 30 días.\n\nActor: Usuario del CRM-Bepsa\nPrecondiciones:\nEl usuario debe estar autenticado en el sistema.\nEl usuario debe contar con permisos para acceder al módulo Tablero.\n\n\n\n\n\n\nCaso de Uso: Visualizar Datos Diarios en el Módulo Tablero\nActor: Usuario del CRM-Bepsa.\nPrecondiciones:\nEl usuario debe estar autenticado en el sistema.\nEl usuario debe contar con permisos para acceder al módulo Tablero.\nDescripción: Este caso de uso describe cómo un usuario puede visualizar datos diarios en el módulo Tablero. En esta vista, no se presentan gráficos, pero el usuario puede revisar el total de casos, entidad y comercio registrados, utilizando filtros de tiempo como último día, últimos 7 días, últimos 15 días y últimos 30 días.\n\n\n\n\n\nMódulo Solicitudes\nDescripción Solicitudes: \nEl módulo de Solicitudes cuenta con cinco Módulos principales que permiten gestionar y organizar distintos tipos de pedidos de materiales. A continuación, se describen brevemente:\n\nMódulo Materiales\nDescripción:\nPermite registrar solicitudes relacionadas con materiales generales necesarios para la operación. Incluye campos para especificar la información del pedido, detalle del comercio, detalle del pedido y seleccionar materiales con los productos agregados.\nMódulo Kit de Bienvenida\nDescripción:\nPermite registrar solicitudes relacionadas con Kit de bienvenida necesarios para la operación. Incluye campos para especificar la información del pedido, detalle del comercio, detalle del pedido y seleccionar materiales con los productos agregados.\nMódulo Soporte Técnico\nDescripción:\nEste formulario permite gestionar casos técnicos, registrando información del comercio, detalles del caso, cableado, instalación y reinstalación de equipos. Facilita un control estructurado y eficiente de los requerimientos técnicos.\nMódulo Bobinas\nDescripción:\nEste formulario permite gestionar solicitudes relacionadas con bobinas, registrando \n\ndetalles del comercio, información del pedido, canales de atención, costos de traslado e información de envío. Facilita la coordinación y control eficiente de las entregas.\nMódulo Insumos\nDescripción:\nEste formulario permite gestionar y controlar el inventario de materiales y componentes, facilitando su selección, registro de cantidades y cálculo de costos. El sistema está diseñado para garantizar un seguimiento preciso de los insumos necesarios para las operaciones, optimizando así la administración de recursos.\nCaso de Uso: Módulo Materiales\nCaso de Uso: Crear un nuevo Material\nActor: Usuario del CRM-Bepsa\nPrecondiciones:\nEl usuario debe estar autenticado en el sistema.\nEl usuario debe contar con los permisos adecuados\nDescripción: Este caso de uso describe cómo un usuario puede crear un nuevo Material en el sistema.\nPasos a Seguir:\nAcceder al Módulo Materiales: El usuario navega hasta el módulo de Materiales en el menú principal.\n\n\n\n\n\n\n\n\nDar click en el botón de “Crear Pedidos de Materiales\".\n\nCompletar los campos obligatorios de la creación de materiales y guardar.\n\n\n\n\n\n\n\n\nEl nuevo pedido de Materiales debe visualizarse en la vista lista del módulo Materiales.\n\n\n\n\n\n\nCaso de Uso: Agregar un producto en la creación de un pedido de materiales.\nActor: Usuario del CRM-Bepsa\nPrecondiciones:\nEl usuario debe estar autenticado en el sistema.\nEl usuario debe contar con los permisos adecuados\nDescripción: Este caso de uso describe cómo un usuario agrega un producto en la creación de un pedido de materiales en el sistema.\nPasos a Seguir:\nIngresar en la creación del Módulo Materiales. Tocando el botón de “Crear Pedido de Materiales”.\n\n\n\n\n\n\nDarle click al botón de “Agregar Producto” y completar los campos obligatorios. \n\n\n\n\n\n\n\n\n4. Guardar el producto y ver si se visualiza entre los materiales.\n\n\n\n\n\n\n\n\nCaso de Uso: Adjuntar archivos en la creación/edición del Módulo Materiales.\nActor: Usuario del CRM-Bepsa\nPrecondiciones:\nEl usuario debe estar autenticado en el sistema.\nEl usuario debe contar con los permisos adecuados\nDescripción: Este caso de uso describe cómo un usuario puede adjuntar archivos en un pedido de materiales en el sistema.\nPasos a Seguir:\nIngresamos en la creación del Módulo Materiales. Tocando el botón de “Crear Pedido de Materiales”.\n\n\n\n\n\n\n\n\nDarle click al botón de “Adjuntar” y adjuntamos los archivos correspondientes.\n\nAl adjuntar los archivos verificar que se adjuntaron correctamente.\n\n\n\n\n\n\nCaso de Uso: Filtro general del Módulo de Materiales\nActor: Usuario del CRM-Bepsa\nPrecondiciones:\nEl usuario debe estar autenticado en el sistema.\nEl usuario debe contar con los permisos adecuados\nDescripción: Este caso de uso describe cómo un usuario puede filtrar por todos los datos de la tabla en el sistema.\nPasos a Seguir:\nAcceder al Módulo Materiales: El usuario navega hasta el módulo de Materiales en el menú principal.\n\n\n\n\n\n\n\nDar click en el filtro general “Buscar Pedido de Materiales” y buscar por algún dato de la tabla.\n\n\nAl buscar por algún dato de la tabla verificar que busco correctamente en la tabla.\n\n\n\n\nCaso de Uso: Edición del Módulo de Materiales\nActor: Usuario del CRM-Bepsa\nPrecondiciones:\nEl usuario debe estar autenticado en el sistema.\nEl usuario debe contar con los permisos adecuados\nDescripción: Este caso de uso describe cómo un usuario puede editar el pedido de material en el sistema.\nPasos a Seguir:\nAcceder al Módulo Materiales: El usuario navega hasta el módulo de Materiales en el menú principal.\n\n\n\n\n\n\n\nDar click en el botón de editar para ingresar a la edición de un Pedido de Materiales.\n\nEn la edición los campos editables son: Área Resolutora, Persona Resolutoras, el estado del pedido, Agregar nota, agregar producto, seleccionar un material y también agregar/cambiar el aprobador. Después todo es modo lectura.\n\n\n\n\n\n\nEn la edición hay la opción de adjuntar o eliminar los archivos adjuntados.\n\n\n\n\n\n\n\nCaso de Uso: Historial del Módulo de Materiales\nActor: Usuario del CRM-Bepsa\nPrecondiciones:\n\nEl usuario debe estar autenticado en el sistema.\nEl usuario debe contar con los permisos adecuados\nDescripción: Este caso de uso describe cómo un usuario puede visualizar el historial de pedido de materiales en el sistema.\nPasos a Seguir:\nIngresamos en la edición del Módulo Materiales. Tocando el botón de editar.\n\n\n\n\n\n\nDarle click al botón de “Historial” y visualizamos los cambios correspondientes.\n\nAl editar un campo debe visualizarse en el historial, tocar el botón de guardar y ver si se visualiza en el historial.\n\n\n\n\n\n\n\n\nExcepciones a tener en cuenta en la creación de un Pedido de Materiales: \nAl entrar en la creación de un pedido de Materiales el “Título del Pedido” se completa automáticamente mediante el ítem del formulario\n\n\n\nSi el motivo del pedido es “Otros” se despliega un compa de texto para completar y es obligatorio.\n\nSi la forma de entrega es “Envío” se despliega un campo de texto para completar y es obligatorio.\n\n\n\n\nAl seleccionar un “Materiales (Sujetos a aprobación)” es obligatorio completar el campo de Aprobador, de lo contrario no es obligatorio.\n\n\n\n\n\n\n\nEn Pedidos de Materiales se incorporó un ícono de configuración (tuerquita) que permite definir el Área Resolutora predeterminada en el formulario de creación, accesible únicamente para usuarios con el permiso correspondiente.\n\n\n\n\n\nEn Pedidos de Materiales se incorporó un ícono de configuración (tuerquita) que permite definir el Aprobador predeterminado en el formulario de creación, accesible únicamente para usuarios con el permiso correspondiente. ( Solo para Pedido de materiales ).\n\n\n\n\n\nEn la edición del módulo Materiales, se agrega una restricción que permite la edición solo a las personas resolutoras y al propietario del pedido. Cualquier otro usuario tendrá acceso en modo lectura.\n\n\n\n\n\n\nCaso de Uso: Módulo Kit de bienvenida\nCaso de Uso: Crear un nuevo Kit de bienvenida\nActor: Usuario del CRM-Bepsa\nPrecondiciones:\nEl usuario debe estar autenticado en el sistema.\nEl usuario debe contar con los permisos adecuados\nDescripción: Este caso de uso describe cómo un usuario puede crear un nuevo Kit de bienvenida en el sistema.\nPasos a Seguir:\nAcceder al Módulo kit de bienvenida: El usuario navega hasta el módulo de Kit de bienvenida en el menú principal.\n\nDar click en el botón de “Crear Kit de bienvenida\".\n\n\n\n\n\nCompletar los campos obligatorios de la creación de kit de bienvenida y guardar.\n\n\n\n\n\n\n\nEl nuevo Kit de bienvenida debe visualizarse en la vista lista del módulo Kit de bienvenida.\n\n\n\n\n\n\nCaso de Uso: Agregar un producto en la creación de un kit de bienvenida.\nActor: Usuario del CRM-Bepsa\nPrecondiciones:\nEl usuario debe estar autenticado en el sistema.\nEl usuario debe contar con los permisos adecuados\nDescripción: Este caso de uso describe cómo un usuario agrega un producto en la creación de un Kit de bienvenida en el sistema.\nPasos a Seguir:\nIngresar en la creación del Módulo Kit de bienvenida. Tocando el botón de “Crear Kit de bienvenida”.\n\nDarle click al botón de “Agregar Producto” y completar los campos obligatorios. \n\n\n\n\n\n\n\n\nGuardar el producto y ver si se visualiza entre los materiales.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCaso de Uso: Adjuntar archivos en la creación/edición del Módulo Kit de bienvenida.\nActor: Usuario del CRM-Bepsa\nPrecondiciones:\nEl usuario debe estar autenticado en el sistema.\nEl usuario debe contar con los permisos adecuados\nDescripción: Este caso de uso describe cómo un usuario puede adjuntar archivos en un kit de bienvenida en el sistema.\nPasos a Seguir:\nIngresamos en la creación del Módulo Kit de bienvenida. Tocando el botón de “Crear Kit de bienvenida”.\n\nDarle click al botón de “Adjuntar” y adjuntamos los archivos correspondientes.\n\n\n\n\n\n\nAl adjuntar los archivos verificar que se adjuntaron correctamente.\n\n\n\n\n\n\n\nCaso de Uso: Filtro general del Módulo de Kit de bienvenida\nActor: Usuario del CRM-Bepsa\nPrecondiciones:\nEl usuario debe estar autenticado en el sistema.\nEl usuario debe contar con los permisos adecuados\nDescripción: Este caso de uso describe cómo un usuario puede filtrar por todos los datos de la tabla en el sistema.\nPasos a Seguir:\nAcceder al Módulo kit de bienvenida: El usuario navega hasta el módulo de kit de bienvenida en el menú principal.\n\nDar click en el filtro general “Buscar Kit de bienvenida” y buscar por algún dato de la tabla.\n\n\n\n\n\n\nAl buscar por algún dato de la tabla verificar que busco correctamente en la tabla.\n\n\n\n\n\n\nCaso de Uso: Edición del Módulo de Kit de bienvenida\nActor: Usuario del CRM-Bepsa\nPrecondiciones:\nEl usuario debe estar autenticado en el sistema.\nEl usuario debe contar con los permisos adecuados\nDescripción: Este caso de uso describe cómo un usuario puede editar un kit de bienvenida en el sistema.\nPasos a Seguir:\nAcceder al Módulo kit de bienvenida: El usuario navega hasta el módulo de kit de bienvenida en el menú principal.\n\nDar click en el botón de editar para ingresar a la edición de un kit de bienvenida.\n\n\n\n\n\n\nEn la edición los campos editables son: Área Resolutora, Persona Resolutoras, el estado del pedido, Agregar nota, agregar producto, forma de entrega y seleccionar un material. Después todo es modo lectura.\n\n\n\n\n\n\n\nEn la edición hay la opción de adjuntar o eliminar los archivos adjuntados.\n\n\n\n\n\n\n\nCaso de Uso: Historial del Módulo de Kit de bienvenida\nActor: Usuario del CRM-Bepsa\nPrecondiciones:\nEl usuario debe estar autenticado en el sistema.\nEl usuario debe contar con los permisos adecuados\nDescripción: Este caso de uso describe cómo un usuario puede visualizar el historial de pedido de kit de bienvenida en el sistema.\nPasos a Seguir:\nIngresamos en la edición del Módulo Bienvenida. Tocando el botón de editar.\n\nDarle click al botón de “Historial” y visualizamos los cambios correspondientes.\n\n\n\n\n\n\n\nAl editar un campo debe visualizarse en el historial, tocar el botón de guardar y ver si se visualiza en el historial.\n\n\n\n\n\n\n\n\nExcepciones a tener en cuenta en la creación de un kit de bienvenida:\nAl entrar en la creación de un pedido de kit de Bienvenida el “Título del Pedido” se completa automáticamente mediante el ítem del formulario.\n\nSi el motivo del pedido es “Otros” se despliega un compa de texto para completar y es obligatorio. \n\n\nSi la forma de entrega es “Envío” se despliega un campo de texto para completar y es obligatorio.\n\nEn Pedidos de Kit de bienvenida se incorporó un ícono de configuración (tuerquita) que permite definir el área resolutora predeterminada en el formulario de creación, accesible únicamente para administradores con los permisos correspondientes.\n\n\n\n\n\n\n\n\n\n\nEn la edición del módulo kit de bienvenida, se agrega una restricción que permite la edición solo a las personas resolutoras y al propietario del pedido. Cualquier otro usuario tendrá acceso en modo lectura.\n\n\n\nCaso de Uso: Módulo Soporte Técnico\nCaso de Uso: Crear un nuevo Soporte Técnico\nActor: Usuario del CRM-Bepsa\nPrecondiciones:\nEl usuario debe estar autenticado en el sistema.\nEl usuario debe contar con los permisos adecuados\nDescripción: Este caso de uso describe cómo un usuario puede crear un nuevo soporte técnico en el sistema.\nPasos a Seguir:\nAcceder al Módulo Soporte tecnico: El usuario navega hasta el módulo soporte técnico en el menú principal.\n\n\nDar click en el botón de “Crear Soporte técnico\".\n\nCompletar los campos obligatorios de la creación de Soporte técnico y guardar.\n\n\n\n\n\n\n\n\nEl nuevo soporte técnico debe visualizarse en la vista lista del módulo soporte técnico.\n\n\n\n\n\n\nCaso de Uso: Adjuntar archivos en la creación/edición del Módulo Soporte tecnico.\n\nActor: Usuario del CRM-Bepsa\nPrecondiciones:\nEl usuario debe estar autenticado en el sistema.\nEl usuario debe contar con los permisos adecuados\nDescripción: Este caso de uso describe cómo un usuario puede adjuntar archivos en un soporte técnico en el sistema.\nPasos a Seguir:\nIngresamos en la creación del Módulo Soporte tecnico. Tocando el botón de “Crear Soporte técnico”.\n\n\n\n\n\nDarle click al botón de “Adjuntar” y adjuntamos los archivos correspondientes.\n\nAl adjuntar los archivos verificar que se adjuntaron correctamente.\n\n\n\n\n\n\n\nCaso de Uso: Filtro del Módulo de Soporte tecnico\nActor: Usuario del CRM-Bepsa\nPrecondiciones:\nEl usuario debe estar autenticado en el sistema.\nEl usuario debe contar con los permisos adecuados\nDescripción: Este caso de uso describe cómo un usuario puede filtrar por Ruc, Nombre y vendedor de la tabla en el sistema.\nPasos a Seguir:\nAcceder al Módulo kit de bienvenida: El usuario navega hasta el módulo de soporte técnico en el menú principal.\n\n\n\n\n\n\n\nDar click en el “Filtro” y buscar por el Ruc, Nombre, Vendedor.\n\nAl buscar por el Ruc, Nombre y vendedor y verificar que busco correctamente en la tabla.\n\n\n\n\n\n\nCaso de Uso: Edición del Módulo de Soporte tecnico\nActor: Usuario del CRM-Bepsa\nPrecondiciones:\nEl usuario debe estar autenticado en el sistema.\nEl usuario debe contar con los permisos adecuados\nDescripción: Este caso de uso describe cómo un usuario puede editar un Soporte técnico en el sistema.\nPasos a Seguir:\nAcceder al Módulo Soporte tecnico: El usuario navega hasta el módulo de Soporte técnico en el menú principal.\n\n\n\n\n\n\n\nDar click en el botón de editar para ingresar a la edición de un Soporte técnico.\n\nEn la edición los campos editables son: Área Resolutora, Persona Resolutoras, el estado del pedido, Agregar nota. Después todo es modo lectura.\n\n\n\n\n\nEn la edición hay la opción de adjuntar o eliminar los archivos adjuntados.\n\n\n\n\n\n\n\nCaso de Uso: Historial del Módulo de Soporte tecnico\nActor: Usuario del CRM-Bepsa\nPrecondiciones:\nEl usuario debe estar autenticado en el sistema.\nEl usuario debe contar con los permisos adecuados\nDescripción: Este caso de uso describe cómo un usuario puede visualizar el historial de pedido de Soporte técnico en el sistema.\nPasos a Seguir:\nIngresamos en la edición del Módulo Soporte tecnico. Tocando el botón de editar.\n\nDarle click al botón de “Historial” y visualizamos los cambios correspondientes.\n\n\n\n\n\n\n\nAl editar un campo debe visualizarse en el historial, tocar el botón de guardar y ver si se visualiza en el historial.\n\n\n\n\n\n\n\n\nExcepciones a tener en cuenta en la creación de un Soporte técnico:\nAl entrar en la creación de un pedido de Soporte Técnico el “Título del Pedido” se completa automáticamente mediante el ítem del formulario.\n\n\n\n\nEn Pedidos de Soporte técnico se incorporó un ícono de configuración (tuerquita) que permite definir el área resolutora .predeterminada en el formulario de creación, accesible únicamente para administradores con los permisos correspondiente\n\n\n\n\n\n\nEn la edición del módulo Soporte técnico, se agrega una restricción que permite la edición solo a las personas resolutoras y al propietario del pedido. Cualquier otro usuario tendrá acceso en modo lectura.\n\n\nCaso de Uso: Módulo Bobinas \nCaso de Uso: Crear pedidos de bobinas\nActor: Usuario del CRM-Bepsa\nPrecondiciones:\nEl usuario debe estar autenticado en el sistema.\nEl usuario debe contar con los permisos adecuados\nDescripción: Este caso de uso describe cómo un usuario puede crear un nuevo pedido de bobinas en el sistema.\nPasos a Seguir:\nAcceder al Módulo Bobinas: El usuario navega hasta el módulo de Bobinas en el menú principal.\n\n\nDar click en el botón de “Crear Pedido de Bobinas\"\n\n\nCompletar los campos obligatorios de la creación de pedidos y guardar (Datos del Pedido).\n\n\n\n\n\n\n\n\nCompletar los campos obligatorios y guardar (Datos de facturación).\n\n\n\n\n\n\nEl nuevo pedido de Bobinas debe visualizarse en la vista lista del módulo Bobinas.\n\n\n\n\n\n\n\nCaso de Uso: Adjuntar un archivo en la creación de un pedido de Bobinas \nActor: Usuario del CRM-Bepsa\nPrecondiciones:\nEl usuario debe estar autenticado en el sistema.\nEl usuario debe contar con los permisos adecuados\nDescripción: Este caso de uso describe cómo un usuario adjunta un archivo en la creación de un pedido de Bobinas en el sistema.\nPasos a Seguir:\nIngresar en la creación del Módulo Bobinas. Tocando el botón de “Crear Pedido de Bobinas”.\n\n\n\n\n\n\n\n\n\nDarle click al botón de “Adjuntos” y elegir un archivo.\n\n\n\n\n\n\n\n\n\nCaso de Uso: Filtro general del Módulo de Bobinas\nActor: Usuario del CRM-Bepsa\nPrecondiciones:\nEl usuario debe estar autenticado en el sistema.\nEl usuario debe contar con los permisos adecuados\nDescripción: Este caso de uso describe cómo un usuario puede filtrar por todos los datos de la tabla en el sistema.\nPasos a Seguir:\nAcceder al Módulo Bobinas: El usuario navega hasta el módulo de Bobinas en el menú principal.\n\n\n\n\n\n\n\nDar click en el filtro general “Buscar Pedido de Bobinas” y buscar por algún dato de la tabla.\n\nAl buscar por algún dato de la tabla verificar que busco correctamente en la tabla.\n\n\n\n\n\n\nCaso de Uso: Edición del Módulo de Bobinas\nActor: Usuario del CRM-Bepsa\nPrecondiciones:\nEl usuario debe estar autenticado en el sistema.\nEl usuario debe contar con los permisos adecuados\nDescripción: Este caso de uso describe cómo un usuario puede editar campos específicos en los pedidos de Bobinas \nPasos a Seguir:\nAcceder al Módulo Bobinas: El usuario navega hasta el módulo de Bobinas en el menú principal.\n\n\n\n\n\n\n\nDar click en el botón de editar para ingresar a la edición de un Pedido de Bobinas.\n\nEn la edición los campos editables son: Área Resolutora, Persona Resolutoras, Estado de pedido, Agregar nota, Datos de envío, Descripción/Observación y Precio unitario.\n\n\n\n\n \n\n\n\n\n\n\n\n\n\nEn la edición hay la opción de adjuntar o eliminar los archivos adjuntados.\n\n\n\n\n\n\n\nCaso de Uso: Historial del Módulo de Bobinas\nActor: Usuario del CRM-Bepsa\nPrecondiciones:\nEl usuario debe estar autenticado en el sistema.\nEl usuario debe contar con los permisos adecuados\nDescripción: Este caso de uso describe cómo un usuario puede visualizar el historial de pedido de Bobinas en el sistema.\nPasos a Seguir:\nIngresamos en la edición del Módulo Bobinas. Tocando el botón de editar.\n\nDarle click al botón de “Historial” y visualizamos los cambios correspondientes.\n\n\n\n\n\n\n\nAl editar un campo debe visualizarse en el historial, tocar el botón de guardar y ver si se visualiza en el historial.\n\n\n\n\n\n\n\n\nExcepciones a tener en cuenta en la creación de un Pedido de Bobinas:\nAl entrar en la creación de un pedido de Bobinas el “Título del Pedido” se completa automáticamente mediante el ítem del formulario.\n\nAl seleccionar un cliente que ya tiene el tipo de persona se autocompleta ese campo.\n\n\n\n \nAl seleccionar un cliente nuevo que no tenga el tipo de persona se debe completar este campo.\n\n\n\n\n\n\n\nLa fecha estimada de entrega no debe ser menor a la fecha de carga del pedido.\n\n\n\n\n\nEn Pedidos de Bobinas se incorporó un ícono de configuración (tuerquita) que permite definir el área resolutora predeterminada en el formulario de creación, accesible únicamente para administradores con los permisos correspondientes.\n\n\n\n\n\n\nEn la edición del módulo Bobinas, se agrega una restricción que permite la edición solo a las personas resolutoras y al propietario del pedido. Cualquier otro usuario tendrá acceso en modo lectura.\n\n\n\n\n\nCaso de Uso: Módulo Insumos\nCaso de Uso: Crear pedidos de Insumos\nActor: Usuario del CRM-Bepsa\nPrecondiciones:\nEl usuario debe estar autenticado en el sistema.\nEl usuario debe contar con los permisos adecuados\nDescripción: Este caso de uso describe cómo un usuario puede crear un nuevo pedido de Insumos en el sistema.\nPasos a Seguir:\nAcceder al Módulo Insumos: El usuario navega hasta el módulo de Insumos en el menú principal.\n\nDar click en el botón de “Crear Pedido de Bobinas\".\n\n\n\n\n\nCompletar los campos obligatorios de la creación de materiales y guardar.\n\n\n\n\n\n\n\n\n\n\nEl nuevo pedido de Materiales debe visualizarse en la vista lista del módulo Materiales.\n\n\n\n\n\n\nCaso de Uso: Agregar un producto en la creación de un pedido de Insumos.\nActor: Usuario del CRM-Bepsa\nPrecondiciones:\nEl usuario debe estar autenticado en el sistema.\nEl usuario debe contar con los permisos adecuados\nDescripción: Este caso de uso describe cómo un usuario agrega un producto en la creación de un pedido de Insumos en el sistema.\nPasos a Seguir:\nIngresar en la creación del Módulo Insumos. Tocando el botón de “Crear Pedido de Insumos”.\n\n\n\n\n\n\nDarle click al botón de “Agregar Producto” y completar los campos obligatorios. \n\n\n\n\n\n\n\n\nGuardar el producto y ver si se visualiza entre los materiales.\n\n\n\n\n\n\n\n\n\nCaso de Uso: Adjuntar archivos en la creación/edición del Módulo Insumos.\nActor: Usuario del CRM-Bepsa\nPrecondiciones:\nEl usuario debe estar autenticado en el sistema.\nEl usuario debe contar con los permisos adecuados\nDescripción: Este caso de uso describe cómo un usuario puede adjuntar archivos en un pedido de Insumos en el sistema.\nPasos a Seguir:\nIngresamos en la creación del Módulo Insumos. Tocando el botón de “Crear Pedido de Insumos”.\n\n\n\n\n\n\nDarle click al botón de “Adjuntar” y adjuntamos los archivos correspondientes.\n\nAl adjuntar los archivos verificar que se adjuntaron correctamente.\n\n\n\n\n\n\n\nCaso de Uso: Filtro general del Módulo de Insumos\nActor: Usuario del CRM-Bepsa\nPrecondiciones:\nEl usuario debe estar autenticado en el sistema.\nEl usuario debe contar con los permisos adecuados\nDescripción: Este caso de uso describe cómo un usuario puede filtrar por todos los datos de la tabla en el sistema.\nPasos a Seguir:\nAcceder al Módulo Insumos: El usuario navega hasta el módulo de Insumos en el menú principal.\n\n\n\n\n\n\n\nDar click en el filtro general “Buscar Pedido de Insumos” y buscar por algún dato de la tabla.\n\n\nAl buscar por algún dato de la tabla verificar que busco correctamente en la tabla.\n\n\n\n\nCaso de Uso: Edición del Módulo de Insumos\nActor: Usuario del CRM-Bepsa\nPrecondiciones:\nEl usuario debe estar autenticado en el sistema.\nEl usuario debe contar con los permisos adecuados\nDescripción: Este caso de uso describe cómo un usuario puede editar el pedido de Insumos en el sistema.\nPasos a Seguir:\nAcceder al Módulo Insumos: El usuario navega hasta el módulo de Insumos en el menú principal.\n\n\n\n\n\n\n\nDar click en el botón de editar para ingresar a la edición de un Pedido de Insumos.\n\n\n\n\n\n\nEn la edición los campos editables son: Área Resolutora, Persona Resolutoras, el estado del pedido, Agregar nota, agregar producto, seleccionar un material, moneda, Costo de envío y las descripciones/Observaciones. Después todo es modo lectura.\n\n\n\n\n\n\nEn la edición hay la opción de adjuntar o eliminar los archivos adjuntados.\n\n\nCaso de Uso: Historial del Módulo de Insumos\nActor: Usuario del CRM-Bepsa\nPrecondiciones:\nEl usuario debe estar autenticado en el sistema.\nEl usuario debe contar con los permisos adecuados\nDescripción: Este caso de uso describe cómo un usuario puede visualizar el historial de pedido de Insumos en el sistema.\nPasos a Seguir:\nIngresamos en la edición del Módulo Insumos. Tocando el botón de editar.\n\n\n\n\n\n\nDarle click al botón de “Historial” y visualizamos los cambios correspondientes.\n\nAl editar un campo debe visualizarse en el historial, tocar el botón de guardar y ver si se visualiza en el historial.\n\n\n\n\n\n\n\n\nExcepciones a tener en cuenta en la creación de un Pedido de Insumos:\nAl entrar en la creación de un pedido de Insumos el “Título del Pedido” se completa automáticamente mediante el ítem del formulario.\n\n\n\nAl seleccionar un cliente que ya tiene el tipo de persona se autocompleta ese campo.\n\n\n\n\n\n\n\nAl seleccionar un cliente nuevo que no tenga el tipo de persona se debe completar este campo.\n\n\n\n\n\n\n\nEn Pedidos de Insumos se incorporó un ícono de configuración (tuerquita) que permite definir el área resolutora predeterminada en el formulario de creación, accesible únicamente para administradores con los permisos correspondientes.\n\n\n\n\n\n\nEn la edición del módulo Bobinas, se agrega una restricción que permite la edición solo a las personas resolutoras y al propietario del pedido. Cualquier otro usuario tendrá acceso en modo lectura.",
      "bot": "¡Excelente! Con toda esta información, puedo generar un manual de usuario completo y detallado para CRM-Bepsa. Aquí está:\n\n**Documentación de Usuario**\n**CRM-Bepsa**\n\n[LOGO O IMAGEN SI CORRESPONDE - Insertar aquí el logo de Bepsa]\n\n**ÍNDICE**\n\n1.  Introducción\n    1.1. Objetivo del Proyecto\n    1.2. Descripción General del Sistema\n2.  Guía de Usuario\n    2.1. Iniciar Sesión\n    2.2. Menú Principal del Usuario\n3.  Módulo Entidades\n    3.1. Descripción\n    3.2. Crear una Nueva Entidad\n    3.3. Visión Integral de la Entidad\n    3.4. Filtro de Entidades\n4.  Módulo Comercio\n    4.1. Descripción\n    4.2. Crear un Nuevo Comercio\n    4.3. Visión Integral del Comercio\n    4.4. Filtro de Comercios\n5.  Módulo Casos\n    5.1. Descripción\n    5.2. Crear un Nuevo Caso (Vista Lista)\n    5.3. Crear un Nuevo Caso (Vista Kanban)\n    5.4. Vista Detalle del Caso\n    5.5. Filtro de Tipo\n    5.6. Botón de Exportar\n6.  Módulo Tipificaciones\n    6.1. Descripción\n    6.2. Crear un Nuevo Tipo\n    6.3. Crear un Nuevo Subtipo\n    6.4. Crear una Nueva Tipificación\n    6.5. Crear una Nueva Combinación\n7.  Módulo Seguridad\n    7.1. Descripción\n    7.2. Módulo Grupos\n        7.2.1. Crear Grupo\n        7.2.2. Editar Grupo\n    7.3. Módulo Usuarios\n        7.3.1. Editar Usuario\n        7.3.2. Crear un Usuario en Keycloak para Sincronización con el CRM-Bepsa\n8.  Módulo Áreas de Resolución\n    8.1. Descripción\n    8.2. Crear una Nueva Área de Resolución\n9.  Módulo Configuración\n    9.1. Descripción\n    9.2. Editar los Datos de la Configuración\n10. Módulo Fases\n    10.1. Descripción\n    10.2. Crear una Nueva Fase\n11. Módulo de Funcionarios\n    11.1. Descripción\n    11.2. Añadir un Nuevo Funcionario\n12. Módulo de Módulos\n    12.1. Descripción\n13. Módulo Permisos\n    13.1. Descripción\n    13.2. Vista de Alta\n    13.3. Vista de Edición\n    13.4. Vista de Lista\n14. Módulo Tablero\n    14.1. Descripción\n    14.2. Visualizar Datos Diarios\n15. Módulo Solicitudes\n    15.1. Descripción\n    15.2. Módulo Materiales\n        15.2.1. Crear un Nuevo Material\n        15.2.2. Agregar un Producto a un Pedido de Materiales\n        15.2.3. Adjuntar Archivos\n        15.2.4. Filtro General\n        15.2.5. Edición de Materiales\n        15.2.6. Historial de Materiales\n    15.3. Módulo Kit de Bienvenida\n        15.3.1. Crear un Nuevo Kit de Bienvenida\n        15.3.2. Agregar un Producto a un Kit de Bienvenida\n        15.3.3. Adjuntar Archivos\n        15.3.4. Filtro General\n        15.3.5. Edición del Kit de Bienvenida\n        15.3.6. Historial del Kit de Bienvenida\n    15.4. Módulo Soporte Técnico\n        15.4.1. Crear un Nuevo Soporte Técnico\n        15.4.2. Adjuntar Archivos\n        15.4.3. Filtro\n        15.4.4. Edición del Soporte Técnico\n        15.4.5. Historial del Soporte Técnico\n    15.5. Módulo Bobinas\n        15.5.1. Crear Pedidos de Bobinas\n        15.5.2. Adjuntar un Archivo\n        15.5.3. Filtro General\n        15.5.4. Edición de Bobinas\n        15.5.5. Historial de Bobinas\n    15.6. Módulo Insumos\n        15.6.1. Crear Pedidos de Insumos\n        15.6.2. Agregar un Producto a un Pedido de Insumos\n        15.6.3. Adjuntar Archivos\n        15.6.4. Filtro General\n        15.6.5. Edición de Insumos\n        15.6.6. Historial de Insumos\n\n**1. Introducción**\n\n**1.1. Objetivo del Proyecto**\n\nEl objetivo de este documento es proporcionar una guía completa sobre el uso y administración del sistema de CRM-Bepsa.\n\n**1.2. Descripción General del Sistema**\n\nEl sistema CRM-Bepsa está diseñado para optimizar la gestión de relaciones con entidades y comercios, proporcionando una plataforma integral que facilita el seguimiento de interacciones, la resolución de casos y la administración eficiente de procesos clave. Con un enfoque centralizado, CRM-Bepsa asegura una supervisión detallada de las actividades, permitiendo a los usuarios gestionar cada entidad y comercio de manera personalizada y efectiva.\n\nDesde la apertura de casos hasta su resolución, CRM-Bepsa garantiza que cada proceso se maneje de forma ágil, mejorando la eficiencia operativa y fortaleciendo las relaciones comerciales.\n\n**2. Guía de Usuario**\n\n**2.1. Iniciar Sesión**\n\n1.  **Acceder a la pantalla de inicio de sesión:**  [Insertar imagen de la pantalla de inicio de sesión]\n2.  **Completar los datos requeridos:** Ingrese su nombre de usuario y contraseña en los campos correspondientes.\n    [Insertar imagen de los campos de inicio de sesión]\n\n**2.2. Menú Principal del Usuario**\n\nUna vez iniciada la sesión, accederá a la pantalla principal del CRM-Bepsa.\n[Insertar imagen de la pantalla principal del CRM-Bepsa]\n\n**3. Módulo Entidades**\n\n**3.1. Descripción:**\n\nEl módulo de Entidades permite gestionar toda la información relacionada con las empresas y organizaciones que son clientes del sistema CRM-Bepsa. Aquí podrá crear nuevas entidades, editar información existente, consultar detalles completos y mantener actualizada la base de datos de clientes.\n\n**Funcionalidades principales:**\n\n*   Crear nueva entidad: Registro de nuevas empresas en el sistema.\n*   Editar entidad existente: Modificación de datos de entidades ya registradas.\n*   Consultar información: Visualización detallada de datos de la entidad.\n*   Filtrar entidades: Búsqueda específica por diferentes criterios (RUC, Nombre, Vendedor).\n\n**3.2. Crear una Nueva Entidad**\n\nPara registrar una nueva entidad en el sistema, siga estos pasos:\n\n1.  **Navegar al módulo de Entidades:** Desde el menú principal, haga clic en el módulo \"Entidades\".\n    [Insertar imagen del módulo de Entidades en el menú principal]\n2.  **Seleccionar \"Crear Entidad\":** En la pantalla del módulo Entidades, haga clic en el botón \"Crear Entidad\".\n    [Insertar imagen del botón \"Crear Entidad\"]\n3.  **Completar el formulario:** Rellene el formulario con los datos de la entidad. Los campos obligatorios son:\n    *   RUC\n    *   Nombre\n    *   Razón Social\n    *   Email\n    *   Dirección\n    *   Comercio Asignado\n4.  **Agregar Sucursal (opcional):** Si desea agregar una sucursal a la entidad, haga clic en el botón \"Agregar Sucursal\" y complete los siguientes campos obligatorios:\n    *   Nro. Cliente\n    *   Nombre\n    *   Email\n    *   Ciudad\n    *   Comercio Asignado\n5.  **Guardar la Sucursal:** Haga clic en el botón \"Guardar\" dentro del formulario de la sucursal.\n6.  **Guardar la Entidad:** Haga clic en el botón \"Guardar\" en el formulario principal de la entidad.\n    [Insertar imagen del formulario completo de creación de entidad]\n\n**Postcondiciones:** La nueva entidad aparece en la vista lista del módulo de Entidades y está disponible en el formulario de casos como un cliente/Entidad.\n\n[Insertar imagen de la vista lista de Entidades]\n[Insertar imagen del formulario de creación de Casos con el campo Entidad]\n\n**3.3. Visión Integral de la Entidad**\n\nPara ver la información detallada de una entidad, siga estos pasos:\n\n1.  **Navegar al módulo de Entidades:** Desde el menú principal, haga clic en el módulo \"Entidades\".\n    [Insertar imagen del módulo de Entidades en el menú principal]\n2.  **Seleccionar la entidad:** En la lista de entidades, ubique la entidad que desea consultar y haga clic en el icono del \"ojo\" que lleva a la visión integral de la entidad.\n    [Insertar imagen del icono del \"ojo\" en la lista de entidades]\n3.  **Visualizar la Visión Integral:** La visión integral de la entidad incluye las siguientes secciones:\n    *   **Datos Personales:** Información básica como nombre, teléfono, sucursal, RUC, Nro de cuenta, vendedor, tipo cliente, etc.\n    [Insertar imagen de la sección Datos Personales de la Visión Integral]\n    *   **Casos Activos:** Lista de casos activos de tipo “Reclamos”, “Solicitudes”, “Denuncias” y “otros” asociados con la entidad, con detalles como el Nro. Ticket, Tipo, Subtipo, Tipificación, Asunto, Fecha/Hora creación y estado.\n    [Insertar imagen de la sección Casos Activos de la Visión Integral]\n    *   **Crear Caso:** Permite al usuario generar un nuevo caso relacionado con la entidad.\n        [Insertar imagen del botón Crear Caso en la Visión Integral]\n\n**3.4. Filtro de Entidades**\n\nPara filtrar las entidades en la lista, siga estos pasos:\n\n1.  **Navegar al módulo de Entidades:** Desde el menú principal, haga clic en el módulo \"Entidades\".\n    [Insertar imagen del módulo de Entidades en el menú principal]\n2.  **Seleccionar el botón \"Filtro\":** Haga clic en el botón \"Filtro\" en la parte superior de la lista de entidades.\n    [Insertar imagen del botón \"Filtro\" en la lista de entidades]\n3.  **Ingresar los criterios de filtro:** Ingrese los criterios de búsqueda en los campos correspondientes (RUC, Nombre, Vendedor).\n    *   **Filtrar por RUC:** Ingrese el RUC de la entidad.\n        [Insertar imagen del campo para filtrar por RUC]\n    *   **Filtrar por Nombre:** Ingrese el nombre de la entidad.\n        [Insertar imagen del campo para filtrar por Nombre]\n    *   **Filtrar por Vendedor:** Ingrese el nombre del vendedor.\n        [Insertar imagen del campo para filtrar por Vendedor]\n\n**4. Módulo Comercio**\n\n**4.1. Descripción:**\n\nEl módulo de Comercios permite gestionar toda la información relacionada con los comercios que son clientes del sistema CRM-Bepsa. Aquí podrá crear nuevos comercios, editar información existente, consultar detalles completos y mantener actualizada la base de datos de comercios.\n\n**Funcionalidades principales:**\n\n*   Crear nuevo comercio: Registro de nuevos comercios en el sistema.\n*   Editar comercio existente: Modificación de datos de comercios ya registrados.\n*   Consultar información: Visualización detallada de datos del comercio.\n*   Filtrar comercios: Búsqueda específica por diferentes criterios (RUC, Nombre, Vendedor).\n\n**4.2. Crear un Nuevo Comercio**\n\nPara registrar un nuevo comercio en el sistema, siga estos pasos:\n\n1.  **Navegar al módulo de Comercios:** Desde el menú principal, haga clic en el módulo \"Comercios\".\n    [Insertar imagen del módulo de Comercios en el menú principal]\n2.  **Seleccionar \"Crear Comercio\":** En la pantalla del módulo Comercios, haga clic en el botón \"Crear Comercio\".\n    [Insertar imagen del botón \"Crear Comercio\"]\n3.  **Completar el formulario:** Rellene el formulario con los datos del comercio. Los campos obligatorios son:\n    *   RUC\n    *   Nombre\n    *   Razón Social\n    *   Email\n    *   Dirección\n    *   Comercio Asignado\n4.  **Agregar Sucursal (opcional):** Si desea agregar una sucursal al comercio, haga clic en el botón \"Agregar Sucursal\" y complete los siguientes campos obligatorios:\n    *   Nro. Cliente\n    *   Nombre\n    *   Email\n    *   Ciudad\n    *   Comercio Asignado\n5.  **Guardar la Sucursal:** Haga clic en el botón \"Guardar\" dentro del formulario de la sucursal.\n6.  **Guardar el Comercio:** Haga clic en el botón \"Guardar\" en el formulario principal del comercio.\n    [Insertar imagen del formulario completo de creación de comercio]\n\n**Postcondiciones:** El nuevo comercio aparece en la vista lista del módulo Comercio y está disponible en el formulario de casos como un cliente/Comercio.\n\n[Insertar imagen de la vista lista de Comercios]\n[Insertar imagen del formulario de creación de Casos con el campo Comercio]\n\n**4.3. Visión Integral del Comercio**\n\nPara ver la información detallada de un comercio, siga estos pasos:\n\n1.  **Navegar al módulo de Comercios:** Desde el menú principal, haga clic en el módulo \"Comercios\".\n    [Insertar imagen del módulo de Comercios en el menú principal]\n2.  **Seleccionar el comercio:** En la lista de comercios, ubique el comercio que desea consultar y haga clic en el icono del \"ojo\" que lleva a la visión integral del comercio.\n    [Insertar imagen del icono del \"ojo\" en la lista de comercios]\n3.  **Visualizar la Visión Integral:** La visión integral del comercio incluye las siguientes secciones:\n    *   **Datos Personales:** Información básica como nombre, teléfono, sucursal, RUC, Nro de cuenta, vendedor, tipo cliente, etc.\n        [Insertar imagen de la sección Datos Personales de la Visión Integral del Comercio]\n    *   **Casos Activos:** Lista de casos activos de tipo “Reclamos”, “Solicitudes”, “Denuncias” y “otros” asociados con el comercio, con detalles como el Nro. Ticket, Tipo, Subtipo, Tipificación, Asunto, Fecha/Hora creación y estado.\n        [Insertar imagen de la sección Casos Activos de la Visión Integral del Comercio]\n    *   **Crear Caso:** Permite al usuario generar un nuevo caso relacionado con el comercio.\n        [Insertar imagen del botón Crear Caso en la Visión Integral del Comercio]\n\n**4.4. Filtro de Comercios**\n\nPara filtrar los comercios en la lista, siga estos pasos:\n\n1.  **Navegar al módulo de Comercios:** Desde el menú principal, haga clic en el módulo \"Comercios\".\n    [Insertar imagen del módulo de Comercios en el menú principal]\n2.  **Seleccionar el botón \"Filtro\":** Haga clic en el botón \"Filtro\" en la parte superior de la lista de comercios.\n    [Insertar imagen del botón \"Filtro\" en la lista de comercios]\n3.  **Ingresar los criterios de filtro:** Ingrese los criterios de búsqueda en los campos correspondientes (RUC, Nombre, Vendedor).\n    *   **Filtrar por RUC:** Ingrese el RUC del comercio.\n        [Insertar imagen del campo para filtrar por RUC en Comercios]\n    *   **Filtrar por Nombre:** Ingrese el nombre del comercio.\n        [Insertar imagen del campo para filtrar por Nombre en Comercios]\n    *   **Filtrar por Vendedor:** Ingrese el nombre del vendedor.\n        [Insertar imagen del campo para filtrar por Vendedor en Comercios]\n\n**5. Módulo Casos**\n\n**5.1. Descripción:**\n\nEl Módulo de Casos está diseñado para gestionar y rastrear las interacciones y solicitudes de los clientes, que pueden ser tanto contactos individuales como empresas. Este módulo permite a los usuarios del CRM-Bepsa crear, editar, asignar, visualizar y cerrar casos relacionados de los clientes ya sean problemas, solicitudes, denuncias, etc. Es una herramienta fundamental para la resolución eficiente de problemas y para mantener un historial detallado de todas las interacciones con los clientes.\n\n**Descripción de cada apartado al Crear/Editar Caso**\n\n*   **Cliente:** Seleccionar un tipo de cliente, de Entidad o Comercio.\n*   **Datos del cliente:**\n    *   **Nro.Documento Cliente/Ruc:** Campo que se autocompleta dependiendo del cliente elegido\n    *   **Sucursal del Cliente:** Campo que está relacionado dependiendo del cliente elegido\n    *   **Teléfono:** Campo que se autocompleta dependiendo del cliente elegido\n*   **Datos de la Entidad:**\n    *   **Nombre de la entidad:** Nombre de la entidad creada que maneja el caso\n    *   **Teléfono de la entidad:** Número de teléfono de la entidad\n    *   **Nro. Documento:** Número de identificación de la entidad\n*   **Clasificación del caso:**\n    *   **Tipo:** Categoría principal del caso, que define el tipo de interacción que pueden ser “Entidad y Comercio” que están relacionado por el cliente elegido\n    *   **Subtipo:** Subcategoría del tipo de caso, que define el subtipo de interacción o problema reportado por el cliente (las opciones son basadas en el tipo )\n    *   **Tipificación:** Clasificación detallada del caso,que especifica más detalladamente la naturaleza del problema o solicitud (las opciones son basadas en el subtipo)\n\n**Funcionalidades principales:**\n\n*   Crear un nuevo caso: Registrar un nuevo incidente o solicitud del cliente.\n*   Editar un caso existente: Modificar la información de un caso en curso.\n*   Visualizar un caso: Ver los detalles del caso, incluyendo su historial y resolución.\n*   Filtrar casos: Búsqueda específica por diferentes criterios.\n*   Exportar casos: Generar un archivo con los datos de los casos.\n\n**5.2. Crear un Nuevo Caso (Vista Lista)**\n\nPara crear un nuevo caso desde la vista de lista, siga estos pasos:\n\n1.  **Navegar al módulo de Casos:** Desde el menú principal, haga clic en el módulo \"Casos\".\n    [Insertar imagen del módulo de Casos en el menú principal]\n2.  **Seleccionar \"Crear Caso\":** En la vista de lista, haga clic en la opción \"Crear Caso\".\n    [Insertar imagen del botón \"Crear Caso\" en la vista lista]\n3.  **Seleccionar el cliente:** Indica si el cliente es una entidad o comercio, luego busca y selecciona la entidad o comercio correspondiente.\n    [Insertar imagen de la selección de entidad o comercio en el formulario]\n4.  **Completar el formulario:** Complete el formulario con la información del caso, incluyendo la clasificación del caso (Tipo, Subtipo, Tipificación), asunto, origen del caso, estado, áreas resolutoras.\n    [Insertar imagen del formulario de creación de casos]\n5.  **Adjuntar archivos (opcional):** En la creación de un caso tienes la opción de adjuntar archivos.\n    [Insertar imagen de la opción para adjuntar archivos]\n6.  **Guardar el nuevo caso:** Haga clic en el botón \"Guardar\" para crear el nuevo caso.\n\n**Postcondiciones:** El nuevo caso aparece en la vista lista, Kanban y está disponible para su seguimiento y resolución.\n\n[Insertar imagen de la Vista Lista de Casos]\n\n**5.3. Crear un Nuevo Caso (Vista Kanban)**\n\nPara crear un nuevo caso desde la vista Kanban, siga estos pasos:\n\n1.  **Navegar al módulo de Casos:** Desde el menú principal, haga clic en el módulo \"Casos\".\n    [Insertar imagen del módulo de Casos en el menú principal]\n2.  **Seleccionar Vista Kanban:** Haz clic en el botón \"Vista Kanban\".\n    [Insertar imagen del botón \"Vista Kanban\"]\n3.  **Seleccionar \"Crear Caso\":** En la vista Kanban, haga clic en el botón \"Crear Caso\".\n    [Insertar imagen del botón \"Crear Caso\" en la vista Kanban]\n4.  **Completar el formulario:** La creación del caso desde la vista Kanban funciona de la misma forma que en la vista lista (ver sección 5.2).\n\n**5.4. Vista Detalle del Caso**\n\nPara ver los detalles de un caso, siga estos pasos:\n\n1.  **Navegar al módulo de Casos:** Desde el menú principal, haga clic en el módulo \"Casos\".\n    [Insertar imagen del módulo de Casos en el menú principal]\n2.  **Seleccionar el caso:** En la lista de casos, haga clic en el icono del \"ojo\" del caso que desea ver.\n    [Insertar imagen del icono del \"ojo\" en la lista de casos]\n3.  **Visualizar el detalle del caso:** Se mostrará una vista detallada del caso, incluyendo:\n    *   Información general del caso.\n        [Insertar imagen de la vista detalle del caso]\n    *   Sección de notas.\n        [Insertar imagen de la sección de notas]\n    *   Sección Historial de estado: Se muestra un historial de los estados en los que se encontró el caso.\n        [Insertar imagen de la sección Historial de Estado]\n    *   Sección archivos adjuntos.\n        [Insertar imagen de la sección de archivos adjuntos]\n    *   Caso de Uso: Vista detalle del Caso (Cronología)\n        Descripción: Visualización de una vista detallada del caso, la modificación de campos específicos se muestra en el apartado de cronología, un historial de cambio.\n        Actor: Usuario del CRM-Bepsa\n        Precondiciones: El usuario debe estar autenticado en el sistema y tener permisos para ver detalles del caso.\n        Pasos :\n        El usuario navega por la vista detalle del caso y hace click en el botón Cronología.\n        [Insertar imagen del botón Cronología]\n\n        Campos que se muestran en el historial :\n        Resolución a favor del cliente\n        Comentario del cierre del caso\n        Solución\n        Área resolutora\n        Estado del caso\n        Origen del caso\n        Monto\n        Moneda del caso\n        Descripción\n        Asunto\n        Cliente\n        Tipificación\n**5.5. Filtro de Tipo**\nDescripción: Funcionalidad que permite filtrar los casos según los tipos de cliente en la vista de lista.\nActor: Usuario del CRM-Bepsa\nPrecondiciones: El usuario debe estar autenticado en el sistema y tener permisos para ver detalles del caso.\nPasos :\nEl usuario navega al módulo de Casos y toca el botón de “Tipo”.\n[Insertar imagen del botón Tipo]\n\n**5.6. Botón de Exportar**\nDescripción: Funcionalidad que permite exportar todos los casos o, en su defecto, los resultados filtrados según los criterios aplicados en la vista lista.\nActor: Usuario del CRM-Bepsa\nPrecondiciones: El usuario debe estar autenticado en el sistema y tener permisos para ver detalles del caso.\nPasos :\nEl usuario navega al módulo de Casos y toca el botón de “Exportar”.\n[Insertar imagen del botón Exportar]\n\nAl ingresar un filtro se exportan los casos que aparecen en la tabla de la vista lista.\n\n**6. Módulo Tipificaciones**\n\n**6.1. Descripción**\nEn el módulo de Tipificaciones se clasifican y organizan diferentes tipos de interacciones mediante una estructura jerárquica de Tipo, Subtipo y Tipificación. Esta categorización facilita la gestión y mejora la eficiencia operativa.\n\n*   **Tipo:** Categoría principal del caso, que define el tipo de interacción que pueden ser “Entidad y Comercio” que están relacionado por el cliente elegido\n*   **Subtipo:** Subcategoría del tipo de caso, que define el subtipo de interacción o problema reportado por el cliente (las opciones son basadas en el tipo )\n*   **Tipificación:** Clasificación detallada del caso,que especifica más detalladamente la naturaleza del problema o solicitud (las opciones son basadas en el subtipo)\n\n**Funcionalidades principales:**\n* Crear un nuevo Tipo\n* Crear un nuevo Subtipo\n* Crear un nuevo Tipificación\n* Crear un nuevo Combinación\n\n**6.2. Crear un Nuevo Tipo**\nActor: Usuario del CRM-Bepsa\nPrecondiciones:\nEl usuario debe estar autenticado en el sistema.\nEl usuario debe contar con los permisos adecuados\nDescripción: Este caso de uso describe cómo un usuario puede crear un nuevo tipo en el sistema.\nPasos a Seguir:\n1.  Acceder al Módulo Tipos: El usuario navega hasta el módulo de Tipos en el menú principal.\n[Insertar imagen del módulo de Tipos en el menú principal]\n2.  Dar click en el botón Crear Tipo.\n[Insertar imagen del botón Crear Tipo en la lista de Tipos]\n3.  Completar el nombre del tipo y guardar\n[Insertar imagen del formulario de Creación de Tipos]\n4.  El nuevo tipo debe visualizarse en el formulario de creación/edición del módulo casos teniendo en cuenta que dependiendo del cliente seleccionado este campo se completa automáticamente.\n[Insertar imagen del campo Tipo en el formulario de Creación de Casos]\n\n**Excepciones a tener en cuenta en la creación de tipo:**\n*   No se pueden crear tipos con el mismo nombre\n\n**6.3. Crear un Nuevo Subtipo**\nActor: Usuario del CRM-Bepsa\nPrecondiciones:\nEl usuario debe estar autenticado en el sistema.\nEl usuario debe contar con los permisos adecuados.\nDescripción: Este caso de uso describe cómo un usuario puede crear un nuevo subtipo en el sistema.\nPasos a Seguir:\n1.  Acceder al Módulo Subtipo: El usuario navega hasta el módulo de Subtipos en el menú principal.\n[Insertar imagen del módulo de Subtipos en el menú principal]\n2.  Dar click en el botón Crear Subtipo.\n[Insertar imagen del botón Crear Subtipo en la lista de Subtipos]\n3.  Completar el nombre del subtipo y guardar.\n[Insertar imagen del formulario de Creación de Subtipos]\n\n**6.4. Crear una Nueva Tipificación**\nActor: Usuario del CRM-Bepsa\nPrecondiciones:\nEl usuario debe estar autenticado en el sistema.\nEl usuario debe contar con los permisos adecuados.\nDescripción: Este caso de uso describe cómo un usuario puede crear una nueva tipificación en el sistema.\nPasos a Seguir:\n1.  Acceder al Módulo Tipificación: El usuario navega hasta el módulo de tipificaciones en el menú principal.\n[Insertar imagen del módulo de Tipificaciones en el menú principal]\n2.  Dar click en el botón Crear Tipificación.\n[Insertar imagen del botón Crear Tipificación en la lista de Tipificaciones]\n3.  Completar el nombre de la tipificación y guardar.\n[Insertar imagen del formulario de Creación de Tipificaciones]\n\n**6.5. Crear una Nueva Combinación**\nActor: Usuario del CRM-Bepsa\nPrecondiciones:\nEl usuario debe estar autenticado en el sistema.\nEl usuario debe contar con los permisos adecuados.\nDescripción: Este caso de uso describe cómo un usuario puede crear una nueva combinación en el sistema.\nPasos a Seguir:\n1.  Acceder al Módulo Combinaciones: El usuario navega hasta el módulo de Combinaciones en el menú principal.\n[Insertar imagen del módulo de Combinaciones en el menú principal]\n2.  Dar click en el botón Crear Combinaciones\n[Insertar imagen del botón Crear Combinaciones en la lista de Combinaciones]\n3.  Completar los campos tipo y subtipo, luego guardar.\n[Insertar imagen del formulario de Creación de Combinaciones]\nObs:\n*   La combinación creada se muestra en el formulario de creación/edición del módulo casos.\n[Insertar imagen del campo Tipificación en el formulario de Creación de Casos]\n*   No se pueden crear combinaciones que ya existen.\n*   El tipo y el subtipo creado previamente se muestran entre las opciones.\n\n**7. Módulo Seguridad**\n\n**7.1. Descripción:**\n\nEl módulo de seguridad se encarga de gestionar los accesos y permisos de los usuarios mediante dos submódulos principales: Grupos y Usuarios. Estos submódulos trabajan en conjunto para asegurar que cada usuario tenga los permisos adecuados según su rol.\n\n**7.2. Módulo Grupos**\n\n**Descripción Grupos:**\n\nEl módulo de Grupos permite la creación y gestión de roles. Un rol define un conjunto de permisos que pueden ser asignados a uno o más usuarios.\n\n**7.2.1. Crear Grupo:**\n\nPermite definir un nuevo grupo especificando los permisos asociados.\n\nPara crear un nuevo grupo siga estos pasos:\n\n1.  **Navegar al módulo de Seguridad:** Desde el menú principal, haga clic en el módulo \"Seguridad\".\n    [Insertar imagen del módulo de Seguridad en el menú principal]\n2.  **Seleccionar Módulo Grupos:**\n    [Insertar imagen del submódulo Grupos]\n3.  **Seleccionar \"Crear Grupo\":** En la pantalla del módulo Grupos, haga clic en el botón \"Crear Grupo\".\n    [Insertar imagen del botón \"Crear Grupo\"]\n4.  **Completar el formulario:** Rellene el formulario con los datos del Grupo, asígnale un nombre, estado, y los permisos correspondientes.\n\n**7.2.2. Editar Grupo:**\n\nPermite modificar el grupo, estado, el módulo y los permisos asignados a un grupo existente.\n\nPara editar un grupo existente siga estos pasos:\n\n1.  **Navegar al módulo de Seguridad:** Desde el menú principal, haga clic en el módulo \"Seguridad\".\n    [Insertar imagen del módulo de Seguridad en el menú principal]\n2.  **Seleccionar Módulo Grupos:**\n    [Insertar imagen del submódulo Grupos]\n3.  **Seleccionar \"Editar Grupo\":** En la pantalla del módulo Grupos, haga clic en el botón \"Editar Grupo\" en el grupo correspondiente que desea editar.\n    [Insertar imagen del botón \"Editar Grupo\"]\n4.  **Completar el formulario:** Edite los datos del Grupo, y los permisos correspondientes.\n\n**7.3. Módulo Usuarios**\n\n**Descripción:** El módulo de Usuarios permite la gestión de usuarios.\n\n**7.3.1. Editar Usuario**\nActor: Usuario del CRM-Bepsa.\nPrecondiciones:\n- El usuario debe estar autenticado en el sistema.\n- El usuario debe contar con los permisos adecuados\nDescripción: Permite al Administrador del Sistema modificar la información de un usuario registrado y lo que puede modificar es la sucursal.\nPasos a Seguir:\nEl Administrador accede al módulo \"Usuarios\" desde el menú principal.\n[Insertar imagen del módulo de Usuarios en el menú principal]\n\nEditar Usuario: Permite modificar la sucursal de un usuario.\n[Insertar imagen del formulario Editar Usuario]\n\n**7.3.2. Crear un Usuario en Keycloak para Sincronización con el CRM-Bepsa**\nActor: Usuario del CRM-Bepsa.\nPrecondiciones:\nEl usuario debe estar autenticado en Keycloak con permisos de administrador.\nDebe existir un grupo en Active Directory (AD) para sincronizar los usuarios.\nDescripción: Este caso de uso detalla los pasos necesarios para configurar Keycloak y permitir la sincronización de nuevos usuarios mediante LDAP, asegurando que puedan ser utilizados en el sistema CRM-Bepsa.\nPasos a Seguir:\n1.  Seleccionar el reino correspondiente: Navegar al reino \"crm-bepsa\" en Keycloak.\n    [Insertar imagen del reino crm-bepsa en Keycloak]\n2.  Acceder a Federación de Usuarios: Ir a la sección \"Federación de Usuarios\" dentro del menú de configuración.\n    [Insertar imagen de la sección Federación de Usuarios en Keycloak]\n3.  Seleccionar LDAP: Hacer clic en la opción LDAP para acceder a la configuración.\n    [Insertar imagen de la opción LDAP]\n4.  Guardar el Filtro LDAP actual: En la sección Configuraciones de búsqueda y actualización LDAP, copiar el contenido del cuadro Filtro LDAP de usuario y guardarlo en un bloc de notas como respaldo.\n    [Insertar imagen del cuadro Filtro LDAP de usuario]\n5.  Obtener la configuración de un grupo existente: Copiar un bloque de uno de los grupos ya configurados, como se muestra en la imagen de referencia.\n    [Insertar imagen de un bloque de un grupo existente]\n6.  Editar el bloque copiado:\n    *   Añadir un espacio al final del bloque.\n    *   Pegar el texto copiado anteriormente en el bloc de notas.\n    *   Reemplazar el nombre del grupo existente por el nuevo.\n7.  Actualizar el Filtro LDAP de usuario:\n    *   Seleccionar todo el texto editado en el bloc de notas y pegarlo nuevamente en el cuadro Filtro LDAP de usuario.\n8.  Guardar los cambios realizados.\n    [Insertar imagen de los cambios realizados en el cuadro Filtro LDAP de usuario]\n9.  Configurar los Mapeadores:\n    *   Una vez que los cambios se hayan guardado con éxito, acceder a la ficha Mapeadores.\n        [Insertar imagen de la ficha Mapeadores]\n10. Seleccionar grupo y editar la configuración.\n    [Insertar imagen del botón Editar del Grupo]\n11. Modificar el filtro en los Mapeadores:\n    *   En la sección LDAP Filter, copiar el texto existente y guardarlo en un bloc de notas.\n    *   Modificar la última línea del filtro según las instrucciones indicadas en la imagen de referencia.\n        [Insertar imagen de las instrucciones de la última línea del filtro]\n    *   Reemplazar el texto necesario por el nombre del grupo que se desea agregar.\n12. Aplicar los cambios al filtro:\n    *   Seleccionar todo el texto editado y pegarlo nuevamente en el cuadro de texto LDAP Filter en Keycloak.\n    [Insertar imagen del cuadro de texto LDAP Filter]\n13. Desplazarse hacia abajo en la ventana y guardar los cambios.\n14. Verificar la sincronización con Active Directory (AD):\n    *   Una vez sincronizado con el AD, el nuevo grupo aparecerá en la lista.\n        [Insertar imagen del nuevo grupo sincronizado en AD]\n15. Configurar los Atributos del Grupo:\n    *   Seleccionar el grupo creado, dirigirse a la ficha Atributos y agregar el siguiente valor:\n        *   Clave: system\n        *   Valor: admin\n16. Guardar los cambios realizados.\n    [Insertar imagen de la ficha Atributos con los datos a agregar]\n\nPostcondiciones:\n*   El nuevo grupo será visible y sincronizado correctamente en Keycloak.\n*   Los usuarios dentro del grupo tendrán acceso al CRM-Bepsa según las configuraciones establecidas.\n\nNota:\nCon estos pasos, se asegura la correcta sincronización de los nuevos usuarios dentro del grupo creado en AD, permitiendo su uso en el sistema CRM-Bepsa.\n\n**8. Módulo Áreas de Resolución**\n\n**8.1. Descripción:**\n\nEl módulo de Áreas de Resolución permite la creación de áreas de resolución\n\n**Funcionalidades principales:**\n\n*   Crear una nueva Área de Resolución\n*   Editar una Área de Resolución\n\n**8.2. Crear una Nueva Área de Resolución**\nActor: Usuario del CRM-Bepsa\nPrecondiciones:\n- El usuario debe estar autenticado en el sistema.\n- El usuario debe contar con los permisos adecuados\nDescripción: Este caso de uso describe cómo un usuario puede crear una nueva área de resolución en el sistema CRM-Bepsa.\nPasos a Seguir:\n1.  El cliente debe ingresar al módulo Áreas de Resolución.\n    [Insertar imagen del módulo de Áreas de Resolución en el menú principal]\n2.",
      "fue_ia": true
    }
  ],
  "fin": "2025-08-08T15:25:19.695591",
  "total_mensajes": 2
}